tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
#if ESP32BASE_ENABLE_APP_CONFIG
// Page-scoped CSS for /esp32base/app-config. Kept out of WEB_HEAD so Status, Logs, WiFi,
// Auth, OTA and Tools pages don't pay ~700 B per request for App Config-only styles.
static const char WEB_APPCFG_STYLE[] PROGMEM =
    "<style>"
    ".appcfg{margin:0}.appcfg .pagehead,.appcfg .panel{margin:12px 0}.appcfg .panel{padding:12px}.appcfg .acfield{max-width:760px;margin:0 0 11px}.appcfg .acfield:last-child{margin-bottom:0}.appcfg .acfield>label{margin:0 0 3px}.appcfg input:not([type]),.appcfg input[type=text],.appcfg input[type=number],.appcfg select{font-size:14px;padding:6px 8px;margin:0;border:1px solid #ccd5dd;border-radius:7px;box-sizing:border-box;background:#fff;color:#1f2933}.appcfg input:not([type]),.appcfg input[type=text],.appcfg input[type=number]{width:100%}.appcfg select{max-width:260px;width:auto}.appcfg .acrow{display:flex;gap:7px;align-items:center;max-width:760px}.appcfg .acrow input{flex:1 1 auto;min-width:0}.appcfg .acrow input[type=number]{flex:0 1 14ch;width:14ch}.appcfg .unit{color:var(--eb-muted);font-size:13px;flex:0 0 auto}.appcfg .help{color:var(--eb-muted);font-size:13px;margin:4px 0 0}.appcfg .restart{margin-left:4px;font-size:11px;vertical-align:1px}.appcfg .confirmbox{display:none;border:1px solid var(--eb-line);background:var(--eb-surface);border-radius:8px;padding:10px 12px;margin:12px 0;overflow-x:auto}.appcfg .confirmbox h2{margin-bottom:4px}.appcfg .confirmbox .reviewhint{color:var(--eb-muted);font-size:13px;margin:0 0 8px}.appcfg .confirmbox table,.appcfg .pendingbox table{border-collapse:collapse;width:100%;font-size:13px}.appcfg .confirmbox th,.appcfg .confirmbox td,.appcfg .pendingbox th,.appcfg .pendingbox td{border-bottom:1px solid var(--eb-line);padding:5px;text-align:left;vertical-align:top}.appcfg .confirmbox tr:last-child td,.appcfg .pendingbox tr:last-child td{border-bottom:0}.appcfg .acgroup th{background:var(--eb-soft);color:var(--eb-muted);font-size:12px;font-weight:700}.appcfg .confirmbox .cancelbtn{background:#f3f5f5;color:#344054;border:1px solid var(--eb-line)}.appcfg .confirmbox .cancelbtn:hover{background:#e9eef2}.appcfg .pendingbox{border-color:#efcf96;background:var(--eb-warn-soft);overflow-x:auto}.appcfg #acsavebar,.appcfg .confirmbox .actions{max-width:760px}@media(max-width:640px){.appcfg select{width:100%;max-width:none}.appcfg .acrow{align-items:flex-start}.appcfg .acrow input[type=number]{max-width:100%}.appcfg .unit{padding-top:7px}}"
    "</style>";
#endif

void flushChunkBuffer();
bool sendResponseContent(const char* data, size_t len);
bool sendRawChunkedContent(const char* data, size_t len);
bool sendResponseHeader(const char* name, const char* value);
void markRequest();
void sendChunk(const char* data, size_t len);
void sendChunk(const char* text);
void sendEscapedHtmlChunk(const char* text);
void formatReadableBytes(uint64_t bytes, char* out, size_t len);
bool ensureAuth();

Esp32BaseWeb::Method fromHttpMethod(HTTPMethod method) {
    switch (method) {
        case HTTP_GET: return Esp32BaseWeb::METHOD_GET;
        case HTTP_POST: return Esp32BaseWeb::METHOD_POST;
        default: return Esp32BaseWeb::METHOD_UNKNOWN;
    }
}

const char* methodName(Esp32BaseWeb::Method method) {
    switch (method) {
        case Esp32BaseWeb::METHOD_GET: return "GET";
        case Esp32BaseWeb::METHOD_POST: return "POST";
        case Esp32BaseWeb::METHOD_ANY: return "ANY";
        case Esp32BaseWeb::METHOD_UNKNOWN:
        default: return "UNKNOWN";
    }
}

const char* uiToneClass(Esp32BaseWeb::UiTone tone) {
    switch (tone) {
        case Esp32BaseWeb::UI_OK: return " ok";
        case Esp32BaseWeb::UI_WARN: return " warn";
        case Esp32BaseWeb::UI_DANGER: return " danger";
        case Esp32BaseWeb::UI_INFO: return " info";
        case Esp32BaseWeb::UI_NEUTRAL:
        default: return "";
    }
}

uint8_t routeCount(bool appPageOnly) {
    uint8_t count = 0;
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && (!appPageOnly || g_routes[i].appPage)) {
            ++count;
        }
    }
    return count;
}

bool validAuthUser(const char* value) {
    if (!value) {
        return false;
    }
    const size_t len = strlen(value);
    if (len == 0 || len >= sizeof(g_authUser)) {
        return false;
    }
    for (const char* p = value; *p; ++p) {
        const uint8_t c = static_cast<uint8_t>(*p);
        if (c <= 0x20 || c >= 0x7f || c == ':') {
            return false;
        }
    }
    return true;
}

bool validAuthPass(const char* value) {
    if (!value) {
        return false;
    }
    const size_t len = strlen(value);
    if (len == 0 || len > 63) {
        return false;
    }
    for (const char* p = value; *p; ++p) {
        const uint8_t c = static_cast<uint8_t>(*p);
        if (c <= 0x20 || c >= 0x7f) {
            return false;
        }
    }
    return true;
}

bool parseBasicAuth(char* user, size_t userLen, char* pass, size_t passLen) {
    if (!user || userLen == 0 || !pass || passLen == 0) {
        return false;
    }
    user[0] = '\0';
    pass[0] = '\0';
    const String header = g_server.header("Authorization");
    if (!header.startsWith("Basic ")) {
        return false;
    }
    if (header.length() > 180) {
        char lengthBuf[24];
        Esp32BaseLog::formatBytes(header.length(), lengthBuf, sizeof(lengthBuf));
        ESP32BASE_LOG_W("web", "auth_header_rejected reason=too_long length=%s", lengthBuf);
        return false;
    }
    const char* encoded = header.c_str() + 6;
    uint8_t decoded[128];
    size_t decodedLen = 0;
    if (mbedtls_base64_decode(decoded, sizeof(decoded) - 1U, &decodedLen,
                              reinterpret_cast<const unsigned char*>(encoded), strlen(encoded)) != 0) {
        return false;
    }
    decoded[decodedLen] = '\0';
    char* colon = strchr(reinterpret_cast<char*>(decoded), ':');
    if (!colon) {
        return false;
    }
    *colon = '\0';
    const char* decodedUser = reinterpret_cast<char*>(decoded);
    const char* decodedPass = colon + 1;
    if (strlen(decodedUser) >= userLen || strlen(decodedPass) >= passLen) {
        return false;
    }
    strlcpy(user, decodedUser, userLen);
    strlcpy(pass, decodedPass, passLen);
    return true;
}

bool authMatches(const char* user, const char* pass) {
    if (!user || !pass || strcmp(user, g_authUser) != 0) {
        return false;
    }
    return strcmp(pass, g_authPass) == 0;
}

bool parseAndCheckAuth(const char* context) {
    char user[32];
    char pass[64];
    if (!parseBasicAuth(user, sizeof(user), pass, sizeof(pass))) {
        if (!g_authLoggedForRequest) {
            g_authLoggedForRequest = true;
            ESP32BASE_LOG_W("web", "auth_request context=%s result=missing_or_invalid", context ? context : "unknown");
        }
        return false;
    }
    const bool ok = authMatches(user, pass);
    if (!g_authLoggedForRequest) {
        g_authLoggedForRequest = true;
        if (!ok) {
            ESP32BASE_LOG_W("web", "auth_request context=%s user=%s password=%s result=failed",
                            context ? context : "unknown",
                            user,
                            pass);
        }
    }
    return ok;
}

void applyPlainAuth(const char* user, const char* pass) {
    strlcpy(g_authUser, user, sizeof(g_authUser));
    strlcpy(g_authPass, pass, sizeof(g_authPass));
    g_authLoadedFromStorage = false;
}

void applyDefaultAuth() {
    applyPlainAuth(g_defaultAuthSet ? g_defaultAuthUser : "admin",
                   g_defaultAuthSet ? g_defaultAuthPass : "admin");
}

void applyStoredAuth(const char* user, const char* pass) {
    strlcpy(g_authUser, user, sizeof(g_authUser));
    strlcpy(g_authPass, pass, sizeof(g_authPass));
    g_authLoadedFromStorage = true;
}

