tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
uint8_t appPageCount() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && g_routes[i].appPage) {
            ++count;
        }
    }
    return count;
}

uint8_t navItemCount() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (g_navItems[i].path[0]) {
            ++count;
        }
    }
    return count;
}

bool navPathExists(const char* path) {
    if (!path || !path[0]) {
        return false;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (g_navItems[i].path[0] && strcmp(g_navItems[i].path, path) == 0) {
            return true;
        }
    }
    return false;
}

uint8_t appNavCount() {
    uint8_t count = navItemCount();
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && g_routes[i].appPage && !navPathExists(g_routes[i].path)) {
            ++count;
        }
    }
    return count;
}

const char* configuredHomePath() {
    if (g_homePath[0]) {
        return g_homePath;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (g_navItems[i].path[0]) {
            return g_navItems[i].path;
        }
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && g_routes[i].appPage) {
            return g_routes[i].path;
        }
    }
    return "/esp32base";
}

bool useAppHome() {
    return g_homeMode == Esp32BaseWeb::HOME_APP && strcmp(configuredHomePath(), "/esp32base") != 0;
}

bool isBuiltinWebPath(const char* path) {
    static const char prefix[] = "/esp32base";
    if (!path || !path[0]) {
        return false;
    }
    const size_t len = sizeof(prefix) - 1;
    return strncmp(path, prefix, len) == 0 && (path[len] == '\0' || path[len] == '/');
}

bool shouldSendHeadExtra() {
    return g_headExtraCallback && !isBuiltinWebPath(g_activeUri);
}

bool navPathMatches(const char* navPath, const char* currentPath) {
    if (!navPath || !navPath[0] || !currentPath || !currentPath[0]) {
        return false;
    }
    const size_t navLen = strlen(navPath);
    if (strncmp(currentPath, navPath, navLen) != 0) {
        return false;
    }
    if (currentPath[navLen] == '\0') {
        return true;
    }
    return navLen > 1 && currentPath[navLen] == '/';
}

void updateActivePath(const char* candidate, const char* currentPath, const char*& activePath, size_t& activeLen) {
    if (!navPathMatches(candidate, currentPath)) {
        return;
    }
    const size_t len = strlen(candidate);
    if (len > activeLen) {
        activePath = candidate;
        activeLen = len;
    }
}

const char* activeNavPath(bool includeSystemLinks) {
    const char* activePath = nullptr;
    size_t activeLen = 0;
    const char* currentPath = g_activeUri[0] ? g_activeUri : "/";
    updateActivePath(configuredHomePath(), currentPath, activePath, activeLen);
    if (g_homeMode != Esp32BaseWeb::HOME_ESP32BASE) {
        for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
            if (g_navItems[i].path[0]) {
                updateActivePath(g_navItems[i].path, currentPath, activePath, activeLen);
            }
        }
        for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
            if (g_routes[i].handler && g_routes[i].appPage && !navPathExists(g_routes[i].path)) {
                updateActivePath(g_routes[i].path, currentPath, activePath, activeLen);
            }
        }
    }
    if (includeSystemLinks) {
        updateActivePath("/esp32base", currentPath, activePath, activeLen);
        if (navPathMatches("/esp32base/wifi", currentPath) ||
            navPathMatches("/esp32base/auth", currentPath)
#if ESP32BASE_ENABLE_OTA
            || navPathMatches("/esp32base/ota", currentPath)
#endif
        ) {
            activePath = "/esp32base/tools";
            activeLen = strlen(activePath);
        }
        updateActivePath("/esp32base/logs", currentPath, activePath, activeLen);
#if ESP32BASE_ENABLE_APP_CONFIG
        updateActivePath("/esp32base/app-config", currentPath, activePath, activeLen);
#endif
        updateActivePath("/esp32base/tools", currentPath, activePath, activeLen);
    }
    return activePath;
}

void sendLink(const char* path, const char* title, bool paragraph, const char* extraClass = nullptr) {
    sendChunk(paragraph ? "<p><a href='" : "<a href='");
    sendEscapedHtmlChunk(path);
    sendChunk("'");
    if (extraClass && extraClass[0]) {
        sendChunk(" class='");
        sendEscapedHtmlChunk(extraClass);
        sendChunk("'");
    }
    sendChunk(">");
    sendEscapedHtmlChunk(title);
    sendChunk(paragraph ? "</a></p>" : "</a>");
}

void sendNavLink(const char* path, const char* title, bool paragraph, const char* activePath, const char* baseClass = nullptr) {
    char className[24] = "";
    if (baseClass && baseClass[0]) {
        strlcpy(className, baseClass, sizeof(className));
    }
    if (activePath && strcmp(activePath, path) == 0) {
        if (className[0]) {
            strlcat(className, " active", sizeof(className));
        } else {
            strlcpy(className, "active", sizeof(className));
        }
    }
    sendLink(path, title, paragraph, className[0] ? className : nullptr);
}

void sendPaginationLink(const char* label, const Esp32BaseWeb::Pagination& pagination, uint32_t page, bool disabled) {
    if (disabled) {
        sendChunk("<span class='btnlink disabled'>");
        sendEscapedHtmlChunk(label);
        sendChunk("</span>");
        return;
    }
    const char* path = pagination.path ? pagination.path : "/esp32base";
    sendChunk("<a class='btnlink' href='");
    sendEscapedHtmlChunk(path);
    sendChunk(strchr(path, '?') ? "&amp;" : "?");
    if (pagination.query && pagination.query[0]) {
        sendEscapedHtmlChunk(pagination.query);
        sendChunk("&amp;");
    }
    char perValue[16];
    snprintf(perValue, sizeof(perValue), "%lu", static_cast<unsigned long>(pagination.perPage == 0 ? 20 : pagination.perPage));
    sendChunk("per=");
    sendChunk(perValue);
    sendChunk("&amp;");
    char value[16];
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(page));
    sendChunk("page=");
    sendChunk(value);
    sendChunk("'>");
    sendEscapedHtmlChunk(label);
    sendChunk("</a>");
}

void sendPaginationPageNumber(const Esp32BaseWeb::Pagination& pagination, uint32_t page, uint32_t currentPage) {
    char label[12];
    snprintf(label, sizeof(label), "%lu", static_cast<unsigned long>(page));
    if (page == currentPage) {
        sendChunk("<span class='btnlink current' aria-current='page'>");
        sendChunk(label);
        sendChunk("</span>");
        return;
    }
    sendPaginationLink(label, pagination, page, false);
}

void sendPaginationActionPath(const char* path) {
    const char* p = path && path[0] ? path : "/esp32base";
    sendChunk(" action='");
    for (size_t i = 0; p[i] && p[i] != '?'; ++i) {
        char c[2] = {p[i], '\0'};
        sendEscapedHtmlChunk(c);
    }
    sendChunk("'");
}

void sendHiddenInput(const char* name, const char* value) {
    if (!name || !name[0] || strcmp(name, "page") == 0 || strcmp(name, "per") == 0) {
        return;
    }
    sendChunk("<input type='hidden' name='");
    sendEscapedHtmlChunk(name);
    sendChunk("' value='");
    sendEscapedHtmlChunk(value ? value : "");
    sendChunk("'>");
}

