tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
void sendQueryHiddenInputs(const char* query) {
    if (!query || !query[0]) {
        return;
    }
    const char* p = strchr(query, '?');
    p = p ? p + 1 : query;
    while (*p) {
        char name[32] = "";
        char value[80] = "";
        size_t ni = 0;
        while (*p && *p != '=' && *p != '&') {
            if (ni + 1 < sizeof(name)) {
                name[ni++] = *p;
            }
            ++p;
        }
        name[ni] = '\0';
        if (*p == '=') {
            ++p;
            size_t vi = 0;
            while (*p && *p != '&') {
                if (vi + 1 < sizeof(value)) {
                    value[vi++] = *p;
                }
                ++p;
            }
            value[vi] = '\0';
        }
        sendHiddenInput(name, value);
        if (*p == '&') {
            ++p;
        }
    }
}

void sendInfoRowStart(const char* label) {
    sendChunk("<tr><th>");
    sendEscapedHtmlChunk(label);
    sendChunk("</th><td>");
}

void sendInfoRowEnd() {
    sendChunk("</td></tr>");
}

void sendInfoRow(const char* label, const char* value) {
    sendInfoRowStart(label);
    sendEscapedHtmlChunk(value && value[0] ? value : "-");
    sendInfoRowEnd();
}

void sendSubmetricsStart() {
    sendChunk("<div class='submetrics'>");
}

void sendSubmetric(const char* label, const char* value) {
    sendChunk("<span><b>");
    sendEscapedHtmlChunk(label && label[0] ? label : "-");
    sendChunk("</b><em>");
    sendEscapedHtmlChunk(value && value[0] ? value : "-");
    sendChunk("</em></span>");
}

void sendSubmetricsEnd() {
    sendChunk("</div>");
}

void sendStatusTag(Esp32BaseWeb::UiTone tone, const char* text) {
    sendChunk("<span class='tag");
    sendChunk(uiToneClass(tone));
    sendChunk("'>");
    sendEscapedHtmlChunk(text && text[0] ? text : "-");
    sendChunk("</span>");
}

void sendTaggedInfoRow(const char* label, const char* value, Esp32BaseWeb::UiTone tone) {
    sendInfoRowStart(label);
    sendStatusTag(tone, value);
    sendInfoRowEnd();
}

void sendStatusSectionStart(const char* title) {
    sendChunk("<section class='panel statuspage'><h2>");
    sendEscapedHtmlChunk(title);
    sendChunk("</h2><div class='tablewrap'><table class='kv'>");
}

void sendStatusSectionEnd() {
    sendChunk("</table></div></section>");
}

#if ESP32BASE_ENABLE_FS
static const uint8_t FS_TOP_MAX = 10;
static const uint16_t FS_TREE_LIST_LIMIT = 128;
static const uint8_t FS_SCAN_MAX_DEPTH = 8;

struct FsTopEntry {
    char path[96];
    uint64_t size;
};

struct FsScan {
    uint32_t files;
    uint32_t dirs;
    uint32_t entries;
    uint64_t listedSize;
    uint8_t topCount;
    FsTopEntry top[FS_TOP_MAX];
};

struct FsWalkFrame {
    FsScan* scan;
    const char* dir;
    uint8_t depth;
    bool emitRows;
    bool manage;
    uint16_t emitLimit;
    uint16_t* emittedRows;
};

void fsScanYield() {
#if ESP32BASE_ENABLE_WATCHDOG
    Esp32BaseWatchdog::feed();
#endif
    yield();
}

void fsFormatCount(uint32_t count, char* out, size_t len) {
    snprintf(out, len, "%lu", static_cast<unsigned long>(count));
}

void fsJoinPath(const char* dir, const char* name, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!name || !name[0]) {
        strlcpy(out, dir && dir[0] ? dir : "/", len);
        return;
    }
    if (name[0] == '/') {
        strlcpy(out, name, len);
        return;
    }
    if (!dir || !dir[0] || strcmp(dir, "/") == 0) {
        snprintf(out, len, "/%s", name);
        return;
    }
    snprintf(out, len, "%s/%s", dir, name);
}

void fsAddTopFile(FsScan& scan, const char* path, uint64_t size) {
    uint8_t pos = scan.topCount;
    while (pos > 0 && size > scan.top[pos - 1].size) {
        --pos;
    }
    if (pos >= FS_TOP_MAX) {
        return;
    }
    const uint8_t limit = scan.topCount < FS_TOP_MAX ? scan.topCount : static_cast<uint8_t>(FS_TOP_MAX - 1);
    for (int8_t i = static_cast<int8_t>(limit); i > static_cast<int8_t>(pos); --i) {
        scan.top[i] = scan.top[i - 1];
    }
    if (scan.topCount < FS_TOP_MAX) {
        ++scan.topCount;
    }
    scan.top[pos].size = size;
    strlcpy(scan.top[pos].path, path && path[0] ? path : "-", sizeof(scan.top[pos].path));
}

void sendFsDeleteForm(const char* path) {
    sendChunk("<form method='post' action='/esp32base/fs/delete' onsubmit=\"return confirm('Delete this file? This cannot be undone.')&&once(this)\">");
    sendHiddenInput("path", path && path[0] ? path : "");
    sendChunk("<input class='danger fsdelete' type='submit' value='Delete'></form>");
}

void sendFsDownloadForm(const char* path) {
    sendChunk("<form method='get' action='/esp32base/fs/download'>");
    sendHiddenInput("path", path && path[0] ? path : "");
    sendChunk("<input class='secondary fsaction' type='submit' value='Download'></form>");
}

void sendFsFileActions(const char* path, bool manage) {
    sendChunk("<div class='fsactions'>");
    sendFsDownloadForm(path);
    if (manage) {
        sendFsDeleteForm(path);
    }
    sendChunk("</div>");
}

bool fsFileReadableStart(const char* path, size_t size) {
    if (size == 0) {
        return true;
    }
    uint8_t value = 0;
    size_t readLen = 0;
    return Esp32BaseFs::readBytesAt(path, 0, &value, 1, &readLen) && readLen == 1;
}

void sendFsTreeRow(const char* path, size_t size, bool isDir, bool manage) {
    char sizeBuf[48];
    sendChunk("<tr><td>");
    sendEscapedHtmlChunk(path && path[0] ? path : "-");
    sendChunk("</td><td>");
    sendEscapedHtmlChunk(isDir ? "dir" : "file");
    sendChunk("</td><td>");
    if (isDir) {
        sendChunk("-");
    } else {
        formatReadableBytes(size, sizeBuf, sizeof(sizeBuf));
        sendEscapedHtmlChunk(sizeBuf);
    }
    sendChunk("</td><td>");
    if (isDir) {
        sendChunk("-");
    } else if (!fsFileReadableStart(path, size)) {
        sendStatusTag(Esp32BaseWeb::UI_WARN, "unreadable");
    } else {
        sendFsFileActions(path, manage);
    }
    sendChunk("</td></tr>");
}

void fsWalkCallback(const char* name, size_t size, bool isDir, void* user);

bool fsWalkDir(FsScan& scan, const char* dir, uint8_t depth, bool emitRows, bool manage, uint16_t emitLimit, uint16_t* emittedRows) {
    FsWalkFrame frame = {&scan, dir, depth, emitRows, manage, emitLimit, emittedRows};
    return Esp32BaseFs::listDir(dir, fsWalkCallback, &frame);
}

void fsWalkCallback(const char* name, size_t size, bool isDir, void* user) {
    FsWalkFrame* frame = static_cast<FsWalkFrame*>(user);
    if (!frame || !frame->scan) {
        return;
    }
    char path[96];
    fsJoinPath(frame->dir, name, path, sizeof(path));
    frame->scan->entries++;
    if (isDir) {
        frame->scan->dirs++;
    } else {
        frame->scan->files++;
        frame->scan->listedSize += size;
        fsAddTopFile(*frame->scan, path, size);
    }
    if (frame->emitRows && frame->emittedRows && *frame->emittedRows < frame->emitLimit) {
        sendFsTreeRow(path, size, isDir, frame->manage);
        (*frame->emittedRows)++;
    }
    fsScanYield();
    if (isDir && frame->depth + 1 < FS_SCAN_MAX_DEPTH && (!frame->emitRows || !frame->emittedRows || *frame->emittedRows < frame->emitLimit)) {
        fsWalkDir(*frame->scan, path, static_cast<uint8_t>(frame->depth + 1), frame->emitRows, frame->manage, frame->emitLimit, frame->emittedRows);
    }
}

