tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
bool scanFs(FsScan& scan) {
    memset(&scan, 0, sizeof(scan));
    return Esp32BaseFs::isReady() && fsWalkDir(scan, "/", 0, false, false, 0, nullptr);
}

bool fsManageMode() {
    return g_server.hasArg("manage") && g_server.arg("manage") != "0";
}

bool fsInternalUsageHigh(const FsScan& scan) {
    const uint64_t used = Esp32BaseFs::usedBytes();
    if (used <= scan.listedSize) {
        return false;
    }
    const uint64_t gap = used - scan.listedSize;
    return gap > 131072ULL && gap > scan.listedSize;
}

bool validFsFilePath(const char* path) {
    return path && path[0] == '/' && path[1] != '\0' && strlen(path) < 96 &&
           !strstr(path, "..") && !strstr(path, "//");
}

bool validFsDeletePath(const char* path) {
    return validFsFilePath(path);
}

void fsDownloadFilename(const char* path, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    const char* name = path ? strrchr(path, '/') : nullptr;
    name = name && name[1] ? name + 1 : "littlefs.bin";
    size_t used = 0;
    for (const char* p = name; *p && used + 1 < len && used < 63; ++p) {
        const char c = *p;
        const bool ok = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
                        (c >= '0' && c <= '9') || c == '.' || c == '_' || c == '-';
        out[used++] = ok ? c : '_';
    }
    out[used] = '\0';
    if (!validDownloadFilename(out)) {
        strlcpy(out, "littlefs.bin", len);
    }
}

void fsNoopListCallback(const char*, size_t, bool, void*) {
}

void sendFsInventoryValue(const FsScan& scan, uint64_t fsUsed) {
    char files[16];
    char dirs[16];
    char listed[48];
    char other[48];
    fsFormatCount(scan.files, files, sizeof(files));
    fsFormatCount(scan.dirs, dirs, sizeof(dirs));
    formatReadableBytes(scan.listedSize, listed, sizeof(listed));
    const uint64_t overheadBytes = fsUsed > scan.listedSize ? fsUsed - scan.listedSize : 0;
    formatReadableBytes(overheadBytes, other, sizeof(other));
    sendSubmetricsStart();
    sendSubmetric("Files", files);
    sendSubmetric("Dirs", dirs);
    sendSubmetric("Listed size", listed);
    sendSubmetric("Other/overhead", other);
    sendSubmetricsEnd();
}

void sendFsSummaryCell(const char* label, const char* value) {
    sendChunk("<td><b>");
    sendEscapedHtmlChunk(label);
    sendChunk("</b><em>");
    sendEscapedHtmlChunk(value);
    sendChunk("</em></td>");
}

void sendFsSummaryTable(const FsScan& scan) {
    char used[48];
    char total[48];
    char freeBytes[48];
    char files[16];
    char dirs[16];
    char listed[48];
    char other[48];
    const size_t fsUsed = Esp32BaseFs::usedBytes();
    const size_t fsFree = Esp32BaseFs::freeBytes();
    formatReadableBytes(fsUsed, used, sizeof(used));
    formatReadableBytes(Esp32BaseFs::totalBytes(), total, sizeof(total));
    formatReadableBytes(fsFree, freeBytes, sizeof(freeBytes));
    fsFormatCount(scan.files, files, sizeof(files));
    fsFormatCount(scan.dirs, dirs, sizeof(dirs));
    formatReadableBytes(scan.listedSize, listed, sizeof(listed));
    const uint64_t overheadBytes = fsUsed > scan.listedSize ? fsUsed - scan.listedSize : 0;
    formatReadableBytes(overheadBytes, other, sizeof(other));

    sendChunk("<table class='fsummary'><tr><th>FS</th><td>");
    sendStatusTag(fsFree == 0 ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK, fsFree == 0 ? "full" : "ready");
    sendChunk("</td>");
    sendFsSummaryCell("Used", used);
    sendFsSummaryCell("Free", freeBytes);
    sendFsSummaryCell("Total", total);
    sendChunk("</tr><tr><th>File inventory</th>");
    sendFsSummaryCell("Files", files);
    sendFsSummaryCell("Dirs", dirs);
    sendFsSummaryCell("Listed size", listed);
    sendFsSummaryCell("Other/overhead", other);
    sendChunk("</tr></table>");
}

void sendFsSummaryRows(const FsScan& scan) {
    char used[48];
    char total[48];
    char freeBytes[48];
    const size_t fsUsed = Esp32BaseFs::usedBytes();
    const size_t fsFree = Esp32BaseFs::freeBytes();
    formatReadableBytes(fsUsed, used, sizeof(used));
    formatReadableBytes(Esp32BaseFs::totalBytes(), total, sizeof(total));
    formatReadableBytes(fsFree, freeBytes, sizeof(freeBytes));
    sendInfoRowStart("FS");
    sendStatusTag(fsFree == 0 ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK, fsFree == 0 ? "full" : "ready");
    sendChunk("<a class='btnlink compact' href='/esp32base/fs'>Details</a>");
    sendSubmetricsStart();
    sendSubmetric("Used", used);
    sendSubmetric("Free", freeBytes);
    sendSubmetric("Total", total);
    sendSubmetricsEnd();
    sendInfoRowEnd();
    sendInfoRowStart("File inventory");
    sendFsInventoryValue(scan, fsUsed);
    sendInfoRowEnd();
}
#endif

#if ESP32BASE_ENABLE_WATCHDOG
struct WatchdogTripState {
    uint32_t lifetime;
    uint32_t base;
    uint32_t trip;
    uint32_t resetTime;
    bool hasBase;
    bool invalidBase;
};

WatchdogTripState readWatchdogTripState() {
    WatchdogTripState state = {};
    state.lifetime = Esp32BaseWatchdog::lifetimeResetCount();
    const int32_t base = Esp32BaseConfig::getInt("eb_sys", "wdt_trip_base", -1);
    state.hasBase = base >= 0;
    state.base = state.hasBase ? static_cast<uint32_t>(base) : 0;
    state.resetTime = static_cast<uint32_t>(Esp32BaseConfig::getInt("eb_sys", "wdt_trip_time", 0));
    state.invalidBase = state.hasBase && state.base > state.lifetime;
    state.trip = (!state.invalidBase && state.lifetime >= state.base) ? state.lifetime - state.base : 0;
    return state;
}

bool formatEpochTime(uint32_t epoch, char* out, size_t len) {
    if (!out || len == 0 || epoch == 0) {
        return false;
    }
    const time_t raw = static_cast<time_t>(epoch);
    struct tm tmValue;
    localtime_r(&raw, &tmValue);
    return strftime(out, len, "%Y-%m-%d %H:%M:%S", &tmValue) > 0;
}

void formatWatchdogTripResetAt(const WatchdogTripState& state, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!state.hasBase) {
        strlcpy(out, "never", len);
        return;
    }
    if (state.invalidBase) {
        strlcpy(out, "invalid baseline", len);
        return;
    }
#if ESP32BASE_ENABLE_NTP
    if (state.resetTime >= ESP32BASE_NTP_SYNC_MIN_EPOCH && formatEpochTime(state.resetTime, out, len)) {
        return;
    }
#endif
    strlcpy(out, "unknown (time unavailable)", len);
}

