tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
uint32_t currentWatchdogTripResetTime() {
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot time = Esp32BaseNtp::snapshot();
    if (time.synced) {
        return time.epochSec;
    }
#endif
    return 0;
}
#endif

void formatMac(uint64_t mac, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    snprintf(out, len, "%02X:%02X:%02X:%02X:%02X:%02X",
             static_cast<unsigned>(mac & 0xff),
             static_cast<unsigned>((mac >> 8) & 0xff),
             static_cast<unsigned>((mac >> 16) & 0xff),
             static_cast<unsigned>((mac >> 24) & 0xff),
             static_cast<unsigned>((mac >> 32) & 0xff),
             static_cast<unsigned>((mac >> 40) & 0xff));
}

const char* partitionTypeName(esp_partition_type_t type) {
    switch (type) {
        case ESP_PARTITION_TYPE_APP: return "app";
        case ESP_PARTITION_TYPE_DATA: return "data";
        default: return "unknown";
    }
}

const char* partitionSubtypeName(const esp_partition_t* partition) {
    if (!partition) {
        return "unknown";
    }
    if (partition->type == ESP_PARTITION_TYPE_APP) {
        if (partition->subtype >= ESP_PARTITION_SUBTYPE_APP_OTA_MIN &&
            partition->subtype <= ESP_PARTITION_SUBTYPE_APP_OTA_MAX) {
            return partition->label;
        }
        switch (partition->subtype) {
            case ESP_PARTITION_SUBTYPE_APP_FACTORY: return "factory";
            case ESP_PARTITION_SUBTYPE_APP_TEST: return "test";
            default: return "app";
        }
    }
    if (partition->type == ESP_PARTITION_TYPE_DATA) {
        switch (partition->subtype) {
            case ESP_PARTITION_SUBTYPE_DATA_NVS: return "nvs";
            case ESP_PARTITION_SUBTYPE_DATA_PHY: return "phy";
            case ESP_PARTITION_SUBTYPE_DATA_OTA: return "ota";
            case ESP_PARTITION_SUBTYPE_DATA_SPIFFS: return "spiffs";
            case ESP_PARTITION_SUBTYPE_DATA_COREDUMP: return "coredump";
            default: return "data";
        }
    }
    return "unknown";
}

bool samePartition(const esp_partition_t* a, const esp_partition_t* b) {
    return a && b && a->address == b->address && a->size == b->size &&
           a->type == b->type && a->subtype == b->subtype &&
           strncmp(a->label, b->label, sizeof(a->label)) == 0;
}

const char* partitionRole(const esp_partition_t* partition, const esp_partition_t* running, const esp_partition_t* nextOta) {
    if (!partition) {
        return "-";
    }
    if (samePartition(partition, running)) {
        return "running app";
    }
    if (samePartition(partition, nextOta)) {
        return "next OTA";
    }
    if (partition->type == ESP_PARTITION_TYPE_APP) {
        return "app";
    }
    if (partition->type == ESP_PARTITION_TYPE_DATA) {
        switch (partition->subtype) {
            case ESP_PARTITION_SUBTYPE_DATA_NVS: return "NVS config";
            case ESP_PARTITION_SUBTYPE_DATA_OTA: return "OTA state";
            case ESP_PARTITION_SUBTYPE_DATA_SPIFFS: return "app data";
            case ESP_PARTITION_SUBTYPE_DATA_COREDUMP: return "coredump";
            default: return "data";
        }
    }
    return "-";
}

void sendPartitionTable() {
    const esp_partition_t* running = esp_ota_get_running_partition();
    const esp_partition_t* nextOta = esp_ota_get_next_update_partition(nullptr);
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, nullptr);
    sendChunk("<section class='panel statuspage'><h2>Partition Table</h2><div class='tablewrap'><table class='part'><tr><th>Name</th><th>Type</th><th>SubType</th><th>Offset</th><th>Size</th><th>Role</th></tr>");
    while (it) {
        const esp_partition_t* p = esp_partition_get(it);
        if (p) {
            char offset[16];
            char sizeBuf[48];
            snprintf(offset, sizeof(offset), "0x%06lx", static_cast<unsigned long>(p->address));
            formatReadableBytes(p->size, sizeBuf, sizeof(sizeBuf));
            sendChunk("<tr><td>");
            sendEscapedHtmlChunk(p->label);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionTypeName(p->type));
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionSubtypeName(p));
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(offset);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(sizeBuf);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionRole(p, running, nextOta));
            sendChunk("</td></tr>");
        }
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    sendChunk("</table></div></section>");
}

void sendAppLinks(bool paragraph, const char* activePath) {
    const char* home = configuredHomePath();
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (g_navItems[i].path[0] && (paragraph || strcmp(g_navItems[i].path, home) != 0)) {
            sendNavLink(g_navItems[i].path, g_navItems[i].title, paragraph, activePath);
        }
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (!g_routes[i].handler || !g_routes[i].appPage || navPathExists(g_routes[i].path)) {
            continue;
        }
        if (!paragraph && strcmp(g_routes[i].path, home) == 0) {
            continue;
        }
        sendNavLink(g_routes[i].path, g_routes[i].title[0] ? g_routes[i].title : g_routes[i].path, paragraph, activePath);
    }
}

void sendSystemLinks(bool paragraph, const char* activePath = nullptr) {
    sendNavLink("/esp32base", g_builtinLabels[Esp32BaseWeb::BUILTIN_HOME], paragraph, activePath);
    sendNavLink("/esp32base/logs", g_builtinLabels[Esp32BaseWeb::BUILTIN_LOGS], paragraph, activePath);
#if ESP32BASE_ENABLE_APP_CONFIG
    sendNavLink("/esp32base/app-config", "App Config", paragraph, activePath);
#endif
    sendNavLink("/esp32base/tools", g_builtinLabels[Esp32BaseWeb::BUILTIN_TOOLS], paragraph, activePath);
}

void sendMainNav() {
    const char* activePath = activeNavPath(g_systemNavMode == Esp32BaseWeb::SYSTEM_NAV_TOP);
    sendChunk("<nav>");
    sendNavLink(configuredHomePath(), g_deviceName, false, activePath, "brand");
    if (g_homeMode != Esp32BaseWeb::HOME_ESP32BASE) {
        sendAppLinks(false, activePath);
    }
    if (g_systemNavMode == Esp32BaseWeb::SYSTEM_NAV_TOP) {
        sendSystemLinks(false, activePath);
    }
    sendChunk("</nav>");
}

void sendSystemNavSection() {
    if (g_systemNavMode == Esp32BaseWeb::SYSTEM_NAV_BOTTOM) {
        sendChunk("<nav>");
        sendSystemLinks(false, nullptr);
        sendChunk("</nav>");
    }
}

void formatReadableBytes(uint64_t bytes, char* out, size_t len) {
    Esp32BaseLog::formatBytes(bytes, out, len);
}

