tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
void sendFooterStats() {
    char heap[48];
    char uptime[48];
    formatReadableBytes(Esp32BaseSystem::freeHeap(), heap, sizeof(heap));
    Esp32BaseLog::formatUptime(Esp32BaseSystem::uptimeMs(), uptime, sizeof(uptime));
    sendChunk("Free heap: ");
    sendEscapedHtmlChunk(heap);
    sendChunk(" · Up: ");
    sendEscapedHtmlChunk(uptime);
    sendChunk(" · RSSI: ");
    if (Esp32BaseWiFi::isConnected()) {
        char rssi[24];
        snprintf(rssi, sizeof(rssi), "%ld dBm", static_cast<long>(Esp32BaseWiFi::rssi()));
        sendEscapedHtmlChunk(rssi);
    } else {
        sendChunk("-");
    }
}

void sendProgmem(const char* p) {
    if (!p || !g_responseActive || g_responseBroken) {
        return;
    }
    while (true) {
        const size_t space = sizeof(g_chunkBuffer) - 1U - g_chunkUsed;
        if (space == 0) {
            flushChunkBuffer();
            if (g_responseBroken) {
                return;
            }
            continue;
        }

        char* dest = g_chunkBuffer + g_chunkUsed;
        size_t taken = 0;
        while (taken < space) {
            const char c = static_cast<char>(pgm_read_byte(p++));
            if (!c) {
                g_chunkUsed += taken;
                return;
            }
            dest[taken++] = c;
        }
        g_chunkUsed += taken;
    }
}

HTTPMethod toHttpMethod(Esp32BaseWeb::Method method) {
    switch (method) {
        case Esp32BaseWeb::METHOD_POST: return HTTP_POST;
        case Esp32BaseWeb::METHOD_ANY: return HTTP_ANY;
        case Esp32BaseWeb::METHOD_GET:
        default: return HTTP_GET;
    }
}

bool ensureAuth() {
    if (!g_activeUri[0]) {
        markRequest();
    }
    if (!g_authEnabled) {
        return true;
    }
    if (parseAndCheckAuth("check")) {
        return true;
    }
    g_server.requestAuthentication();
    return false;
}

bool isAuthenticated() {
    if (!g_authEnabled) {
        return true;
    }
    return parseAndCheckAuth("verify");
}

void registerRoute(Route& route) {
    Route* routePtr = &route;
    g_server.on(route.path, toHttpMethod(route.method), [routePtr]() {
        g_requestContextActive = true;
        markRequest();
        if (routePtr->handler) {
            routePtr->handler();
        }
        g_responseActive = false;
        g_requestContextActive = false;
        g_currentMethod = Esp32BaseWeb::METHOD_UNKNOWN;
    });
    route.registered = true;
}

bool sendResponseHeader(const char* name, const char* value) {
    if (!g_requestContextActive) {
        ESP32BASE_LOG_W("web", "send_response_header outside request");
        return false;
    }
    if (g_responseActive) {
        ESP32BASE_LOG_W("web", "send_response_header after response started");
        return false;
    }
    if (!validHeaderName(name, 63)) {
        ESP32BASE_LOG_W("web", "send_response_header invalid name");
        return false;
    }
    if (!validHeaderValue(value, 127)) {
        ESP32BASE_LOG_W("web", "send_response_header invalid value");
        return false;
    }
    g_server.sendHeader(name, value);
    return true;
}

bool beginResponse(int code, const char* contentType, const char* filename) {
    if (!g_requestContextActive) {
        ESP32BASE_LOG_W("web", "begin_response outside request");
        return false;
    }
    if (!validHeaderValue(contentType, 63)) {
        ESP32BASE_LOG_W("web", "begin_response invalid content_type");
        return false;
    }
    if (filename && filename[0]) {
        if (!validDownloadFilename(filename)) {
            ESP32BASE_LOG_W("web", "begin_response invalid filename");
            return false;
        }
        char disposition[96];
        strlcpy(disposition, "attachment; filename=\"", sizeof(disposition));
        if (!appendQuotedHeaderValue(disposition, sizeof(disposition), filename) ||
            strlcat(disposition, "\"", sizeof(disposition)) >= sizeof(disposition)) {
            ESP32BASE_LOG_W("web", "begin_response filename too long");
            return false;
        }
        g_server.sendHeader("Content-Disposition", disposition);
    }
    g_chunkUsed = 0;
    g_responseActive = true;
    g_responseBroken = false;
    g_server.setContentLength(CONTENT_LENGTH_UNKNOWN);
    g_server.send(code, contentType, "");
    yield();
    return true;
}

bool responseClientConnected() {
    return g_server.client().connected();
}

void feedWatchdogDuringSend() {
#if ESP32BASE_ENABLE_WATCHDOG
    Esp32BaseWatchdog::feed();
#endif
}

bool writeClientBytes(WiFiClient& client, const char* data, size_t len) {
    if (len == 0) {
        return true;
    }
    feedWatchdogDuringSend();
    const size_t written = client.write(reinterpret_cast<const uint8_t*>(data), len);
    feedWatchdogDuringSend();
    return written == len;
}

bool sendRawChunkedContent(const char* data, size_t len) {
    if (!data && len > 0) {
        return false;
    }
    char header[18];
    const int headerLen = snprintf(header, sizeof(header), "%lx\r\n", static_cast<unsigned long>(len));
    if (headerLen <= 0 || static_cast<size_t>(headerLen) >= sizeof(header)) {
        return false;
    }
    WiFiClient client = g_server.client();
    return writeClientBytes(client, header, static_cast<size_t>(headerLen)) &&
           writeClientBytes(client, data, len) &&
           writeClientBytes(client, "\r\n", 2);
}

void markResponseClientDisconnected() {
    if (!g_responseBroken) {
        g_responseBroken = true;
        ESP32BASE_LOG_W("web", "response_client_disconnected uri=%s", g_activeUri[0] ? g_activeUri : "-");
    }
}

bool sendResponseContent(const char* data, size_t len) {
    if (g_responseBroken) {
        return false;
    }
    if (!responseClientConnected()) {
        markResponseClientDisconnected();
        return false;
    }
    feedWatchdogDuringSend();
    if (!sendRawChunkedContent(data, len)) {
        markResponseClientDisconnected();
        return false;
    }
    feedWatchdogDuringSend();
    yield();
    return true;
}

void flushChunkBuffer() {
    if (g_chunkUsed == 0) {
        return;
    }
    if (g_responseBroken) {
        g_chunkUsed = 0;
        return;
    }
    if (!responseClientConnected()) {
        markResponseClientDisconnected();
        g_chunkUsed = 0;
        return;
    }
    g_chunkBuffer[g_chunkUsed] = '\0';
    sendResponseContent(g_chunkBuffer, g_chunkUsed);
    g_chunkUsed = 0;
}

void sendChunk(const char* data, size_t len) {
    if (!data || len == 0) {
        return;
    }
    if (!g_responseActive) {
        ESP32BASE_LOG_W("web", "send_chunk outside response");
        return;
    }
    if (g_responseBroken) {
        return;
    }
    while (len > 0) {
        const size_t space = sizeof(g_chunkBuffer) - 1U - g_chunkUsed;
        if (space == 0) {
            flushChunkBuffer();
            if (g_responseBroken) {
                return;
            }
            continue;
        }
        size_t take = len;
        if (take > space) {
            take = space;
        }
        memcpy(g_chunkBuffer + g_chunkUsed, data, take);
        g_chunkUsed += take;
        data += take;
        len -= take;
    }
}

