tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
bool footerBarModeFromArg(const String& raw, Esp32BaseWeb::FooterBarMode& mode) {
    if (raw == "off") {
        mode = Esp32BaseWeb::FOOTER_BAR_OFF;
        return true;
    }
    if (raw == "status") {
        mode = Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY;
        return true;
    }
    if (raw == "full") {
        mode = Esp32BaseWeb::FOOTER_BAR_FULL;
        return true;
    }
    return false;
}

#if ESP32BASE_ENABLE_WATCHDOG
void sendWatchdogPanel() {
    const WatchdogTripState state = readWatchdogTripState();
    char count[32];
    char resetAt[32];
    formatWatchdogTripResetAt(state, resetAt, sizeof(resetAt));
    snprintf(count, sizeof(count), "%lu",
             static_cast<unsigned long>(state.lifetime));
    sendChunk("<section class='panel actionpanel'><h2>Watchdog trip</h2><div class='tablewrap'><table class='kv'>");
    sendInfoRow("Lifetime resets", count);
    if (state.invalidBase) {
        sendInfoRow("Trip resets", "invalid baseline");
    } else {
        snprintf(count, sizeof(count), "%lu",
                 static_cast<unsigned long>(state.trip));
        sendInfoRow("Trip resets", count);
    }
    sendInfoRow("Trip reset at", resetAt);
    sendChunk("</table></div><form method='post' action='/esp32base/tools/watchdog-trip-reset' onsubmit=\"return confirm('Reset Watchdog trip counter? Lifetime resets are kept.')&&once(this)\"><div class='actions'><input type='submit' value='Reset Watchdog Trip'></div></form></section>");
}
#endif

#if ESP32BASE_ENABLE_APP_CONFIG
bool validConfigName(const char* value) {
    if (!value) {
        return false;
    }
    const size_t len = strlen(value);
    return len >= 1 && len <= 15;
}

bool appNsAllowed(const char* ns) {
    return validConfigName(ns) && strncmp(ns, "eb_", 3) != 0;
}

Esp32BaseAppConfig::FieldType publicFieldType(AppConfigStoredType type) {
    switch (type) {
        case APP_CFG_STRING: return Esp32BaseAppConfig::FIELD_STRING;
        case APP_CFG_INT: return Esp32BaseAppConfig::FIELD_INT;
        case APP_CFG_DECIMAL: return Esp32BaseAppConfig::FIELD_DECIMAL;
        case APP_CFG_BOOL: return Esp32BaseAppConfig::FIELD_BOOL;
        case APP_CFG_ENUM: return Esp32BaseAppConfig::FIELD_ENUM;
    }
    return Esp32BaseAppConfig::FIELD_STRING;
}

Esp32BaseAppConfig::FieldRef makeFieldRef(const AppConfigFieldSlot& field) {
    Esp32BaseAppConfig::FieldRef ref = {field.groupId, field.ns, field.key, field.label, publicFieldType(field.type), field.restartRequired};
    return ref;
}

bool groupExists(const char* groupId) {
    if (!groupId || !groupId[0]) {
        return false;
    }
    for (uint8_t i = 0; i < g_appConfigGroupCount; ++i) {
        if (strcmp(g_appConfigGroups[i].id, groupId) == 0) {
            return true;
        }
    }
    return false;
}

bool fieldExists(const char* ns, const char* key) {
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        if (strcmp(g_appConfigFields[i].ns, ns) == 0 && strcmp(g_appConfigFields[i].key, key) == 0) {
            return true;
        }
    }
    return false;
}

bool validFieldCommon(const char* groupId, const char* ns, const char* key, const char* label) {
    if (!groupExists(groupId) || !appNsAllowed(ns) || !validConfigName(key) || !label || !label[0] ||
        strlen(label) > Esp32BaseAppConfig::LABEL_MAX_LENGTH) {
        return false;
    }
    return !fieldExists(ns, key);
}

bool validOptionalHelp(const char* help) {
    return !help || strlen(help) <= Esp32BaseAppConfig::HELP_MAX_LENGTH;
}

bool validOptionalUnit(const char* unit) {
    return !unit || strlen(unit) <= Esp32BaseAppConfig::UNIT_MAX_LENGTH;
}

void appConfigLogRegisterFailed(const char* type, const char* ns, const char* key) {
    ESP32BASE_LOG_W("appcfg", "register_failed type=%s ns=%s key=%s", type ? type : "-", ns ? ns : "-", key ? key : "-");
}

bool enumValueAllowed(const Esp32BaseAppConfig::EnumField& field, const char* value) {
    if (!value) {
        return false;
    }
    for (uint8_t i = 0; i < field.optionCount; ++i) {
        if (field.options[i].value && strcmp(field.options[i].value, value) == 0) {
            return true;
        }
    }
    return false;
}

bool validEnumOptions(const Esp32BaseAppConfig::EnumField& field) {
    if (!field.options || field.optionCount == 0) {
        return false;
    }
    for (uint8_t i = 0; i < field.optionCount; ++i) {
        const char* value = field.options[i].value;
        const char* label = field.options[i].label;
        if (!value || !value[0] || strlen(value) > Esp32BaseAppConfig::ENUM_VALUE_MAX_LENGTH ||
            !label || !label[0] || strlen(label) > Esp32BaseAppConfig::LABEL_MAX_LENGTH) {
            return false;
        }
        for (uint8_t j = static_cast<uint8_t>(i + 1); j < field.optionCount; ++j) {
            if (field.options[j].value && strcmp(value, field.options[j].value) == 0) {
                return false;
            }
        }
    }
    return enumValueAllowed(field, field.defaultValue);
}

bool stepMatches(int32_t value, int32_t minValue, int32_t step) {
    if (step <= 0) {
        return false;
    }
    const int64_t diff = static_cast<int64_t>(value) - static_cast<int64_t>(minValue);
    return diff >= 0 && (diff % step) == 0;
}

bool parseStrictInt32(const char* text, int32_t& out) {
    if (!text || !text[0]) {
        return false;
    }
    char* end = nullptr;
    errno = 0;
    const long value = strtol(text, &end, 10);
    if (errno != 0 || !end || *end != '\0' || value < INT32_MIN || value > INT32_MAX) {
        return false;
    }
    out = static_cast<int32_t>(value);
    return true;
}

int32_t pow10Int(uint8_t scale) {
    int32_t factor = 1;
    for (uint8_t i = 0; i < scale; ++i) {
        factor *= 10;
    }
    return factor;
}

bool formatDecimalRaw(int32_t raw, uint8_t scale, char* out, size_t len) {
    if (!out || len == 0 || scale > Esp32BaseAppConfig::DECIMAL_SCALE_MAX) {
        return false;
    }
    if (scale == 0) {
        snprintf(out, len, "%ld", static_cast<long>(raw));
        return true;
    }
    const int32_t factor = pow10Int(scale);
    int64_t absValue = raw;
    const bool neg = absValue < 0;
    if (neg) {
        absValue = -absValue;
    }
    char fracFmt[8];
    snprintf(fracFmt, sizeof(fracFmt), "%%0%ulld", static_cast<unsigned>(scale));
    char fracBuf[12];
    snprintf(fracBuf, sizeof(fracBuf), fracFmt, static_cast<long long>(absValue % factor));
    snprintf(out, len, "%s%lld.%s", neg ? "-" : "", static_cast<long long>(absValue / factor), fracBuf);
    return true;
}

bool parseDecimalRaw(const char* text, uint8_t scale, int32_t& rawOut) {
    if (!text || !text[0] || scale > Esp32BaseAppConfig::DECIMAL_SCALE_MAX) {
        return false;
    }
    const char* p = text;
    bool neg = false;
    if (*p == '-' || *p == '+') {
        neg = *p == '-';
        ++p;
    }
    const int32_t factor = pow10Int(scale);
    const int64_t maxAbsRaw = neg ? (static_cast<int64_t>(INT32_MAX) + 1LL) : static_cast<int64_t>(INT32_MAX);
    int64_t whole = 0;
    bool hadDigit = false;
    while (*p >= '0' && *p <= '9') {
        hadDigit = true;
        const int digit = *p - '0';
        whole = whole * 10 + digit;
        if (whole > maxAbsRaw / factor) {
            return false;
        }
        ++p;
    }
    int64_t frac = 0;
    uint8_t fracDigits = 0;
    if (*p == '.') {
        ++p;
        while (*p >= '0' && *p <= '9') {
            if (fracDigits >= scale) {
                return false;
            }
            frac = frac * 10 + (*p - '0');
            ++fracDigits;
            ++p;
        }
    }
    if (!hadDigit || *p != '\0') {
        return false;
    }
    while (fracDigits < scale) {
        frac *= 10;
        ++fracDigits;
    }
    int64_t raw = whole * factor + frac;
    if (raw > maxAbsRaw) {
        return false;
    }
    if (neg) {
        raw = -raw;
    }
    if (raw < INT32_MIN || raw > INT32_MAX) {
        return false;
    }
    rawOut = static_cast<int32_t>(raw);
    return true;
}

