tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
void appConfigFieldName(uint8_t index, char* out, size_t len) {
    snprintf(out, len, "f%u", static_cast<unsigned>(index));
}

bool getSubmittedRaw(const AppConfigFieldSlot& field, uint8_t index, char* out, size_t len) {
    if (!out || len == 0) {
        return false;
    }
    char name[8];
    appConfigFieldName(index, name, sizeof(name));
    if (field.type == APP_CFG_BOOL) {
        return strlcpy(out, g_server.hasArg(name) ? "1" : "0", len) < len;
    }
    if (!g_server.hasArg(name)) {
        out[0] = '\0';
        return false;
    }
    return strlcpy(out, g_server.arg(name).c_str(), len) < len;
}

bool findSubmittedRaw(const char* ns, const char* key, char* out, size_t len, const AppConfigFieldSlot** fieldOut = nullptr) {
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        const AppConfigFieldSlot& field = g_appConfigFields[i];
        if (strcmp(field.ns, ns) == 0 && strcmp(field.key, key) == 0) {
            if (fieldOut) {
                *fieldOut = &field;
            }
            return getSubmittedRaw(field, i, out, len);
        }
    }
    return false;
}

void readAppConfigValue(const AppConfigFieldSlot& field, char* textOut, size_t textLen, int32_t& rawOut, bool& boolOut) {
    textOut[0] = '\0';
    rawOut = 0;
    boolOut = false;
    switch (field.type) {
        case APP_CFG_STRING:
            Esp32BaseConfig::getStr(field.ns, field.key, textOut, textLen, field.spec.stringField.defaultValue ? field.spec.stringField.defaultValue : "");
            break;
        case APP_CFG_INT:
            rawOut = Esp32BaseConfig::getInt(field.ns, field.key, field.spec.intField.defaultValue);
            snprintf(textOut, textLen, "%ld", static_cast<long>(rawOut));
            break;
        case APP_CFG_DECIMAL:
            rawOut = Esp32BaseConfig::getInt(field.ns, field.key, field.spec.decimalField.defaultRawValue);
            formatDecimalRaw(rawOut, field.spec.decimalField.scale, textOut, textLen);
            break;
        case APP_CFG_BOOL:
            boolOut = Esp32BaseConfig::getBool(field.ns, field.key, field.spec.boolField.defaultValue);
            strlcpy(textOut, boolOut ? "true" : "false", textLen);
            break;
        case APP_CFG_ENUM:
            Esp32BaseConfig::getStr(field.ns, field.key, textOut, textLen, field.spec.enumField.defaultValue ? field.spec.enumField.defaultValue : "");
            break;
    }
}

const char* appConfigEnumLabel(const AppConfigFieldSlot& field, const char* value) {
    if (field.type == APP_CFG_ENUM && value) {
        for (uint8_t i = 0; i < field.spec.enumField.optionCount; ++i) {
            const Esp32BaseAppConfig::EnumOption& opt = field.spec.enumField.options[i];
            if (opt.value && strcmp(opt.value, value) == 0) {
                return opt.label ? opt.label : opt.value;
            }
        }
    }
    return value ? value : "";
}

void appConfigDisplayText(const AppConfigFieldSlot& field, const char* text, bool boolean, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    switch (field.type) {
        case APP_CFG_BOOL:
            strlcpy(out, boolean ? "Enabled" : "Disabled", len);
            break;
        case APP_CFG_ENUM:
            strlcpy(out, appConfigEnumLabel(field, text), len);
            break;
        default:
            strlcpy(out, text ? text : "", len);
            break;
    }
}

void clearAppConfigPendingRestart(AppConfigPendingRestartSlot& slot) {
    if (slot.oldText) {
        free(slot.oldText);
        slot.oldText = nullptr;
    }
    slot.active = false;
    slot.fieldIndex = 0;
    slot.oldRaw = 0;
    slot.oldBool = false;
    slot.oldTextUnavailable = false;
}

AppConfigPendingRestartSlot* findAppConfigPendingRestart(uint8_t fieldIndex) {
    for (uint8_t i = 0; i < ESP32BASE_APP_CONFIG_MAX_FIELDS; ++i) {
        if (g_appConfigPendingRestart[i].active && g_appConfigPendingRestart[i].fieldIndex == fieldIndex) {
            return &g_appConfigPendingRestart[i];
        }
    }
    return nullptr;
}

AppConfigPendingRestartSlot* allocAppConfigPendingRestart(uint8_t fieldIndex) {
    AppConfigPendingRestartSlot* existing = findAppConfigPendingRestart(fieldIndex);
    if (existing) {
        return existing;
    }
    for (uint8_t i = 0; i < ESP32BASE_APP_CONFIG_MAX_FIELDS; ++i) {
        if (!g_appConfigPendingRestart[i].active) {
            g_appConfigPendingRestart[i].active = true;
            g_appConfigPendingRestart[i].fieldIndex = fieldIndex;
            return &g_appConfigPendingRestart[i];
        }
    }
    return nullptr;
}

bool appConfigValueMatchesPendingOriginal(const AppConfigFieldSlot& field, const AppConfigPendingRestartSlot& slot,
                                          const char* newText, int32_t newRaw, bool newBool) {
    switch (field.type) {
        case APP_CFG_STRING:
        case APP_CFG_ENUM:
            if (slot.oldTextUnavailable) {
                return false;
            }
            return strcmp(slot.oldText ? slot.oldText : "", newText ? newText : "") == 0;
        case APP_CFG_INT:
        case APP_CFG_DECIMAL:
            return slot.oldRaw == newRaw;
        case APP_CFG_BOOL:
            return slot.oldBool == newBool;
    }
    return false;
}

void updateAppConfigPendingRestart(const AppConfigFieldSlot& field, uint8_t index,
                                   const char* oldText, int32_t oldRaw, bool oldBool,
                                   const char* newText, int32_t newRaw, bool newBool) {
    if (!field.restartRequired) {
        return;
    }
    AppConfigPendingRestartSlot* slot = findAppConfigPendingRestart(index);
    if (!slot) {
        slot = allocAppConfigPendingRestart(index);
        if (!slot) {
            ESP32BASE_LOG_W("appcfg", "pending_restart_full key=%s", field.key ? field.key : "-");
            return;
        }
        slot->oldRaw = oldRaw;
        slot->oldBool = oldBool;
        if (field.type == APP_CFG_STRING || field.type == APP_CFG_ENUM) {
            const char* value = oldText ? oldText : "";
            slot->oldText = static_cast<char*>(malloc(strlen(value) + 1));
            if (!slot->oldText) {
                slot->oldTextUnavailable = true;
                ESP32BASE_LOG_W("appcfg", "pending_restart_alloc_failed key=%s", field.key ? field.key : "-");
                return;
            }
            strcpy(slot->oldText, value);
        }
    }
    if (appConfigValueMatchesPendingOriginal(field, *slot, newText, newRaw, newBool)) {
        clearAppConfigPendingRestart(*slot);
    }
}

bool hasAppConfigPendingRestart() {
    for (uint8_t i = 0; i < ESP32BASE_APP_CONFIG_MAX_FIELDS; ++i) {
        if (g_appConfigPendingRestart[i].active) {
            return true;
        }
    }
    return false;
}

Esp32BaseAppConfig::FieldValue makeFieldValue(const AppConfigFieldSlot& field, const char* text, int32_t raw, bool boolean) {
    Esp32BaseAppConfig::FieldValue value = {publicFieldType(field.type), text, raw, boolean};
    return value;
}

bool validateSubmittedField(const AppConfigFieldSlot& field, const char* submitted, char* normalized, size_t normalizedLen,
                            int32_t& rawOut, bool& boolOut, char* error, size_t errorLen) {
    normalized[0] = '\0';
    rawOut = 0;
    boolOut = false;
    switch (field.type) {
        case APP_CFG_STRING: {
            const size_t len = submitted ? strlen(submitted) : 0;
            if (!submitted || len < field.spec.stringField.minLength || len > field.spec.stringField.maxLength) {
                snprintf(error, errorLen, "%s length must be %u..%u.", field.label, field.spec.stringField.minLength, field.spec.stringField.maxLength);
                return false;
            }
            strlcpy(normalized, submitted, normalizedLen);
            break;
        }
        case APP_CFG_INT:
            if (!parseStrictInt32(submitted, rawOut) || rawOut < field.spec.intField.minValue ||
                rawOut > field.spec.intField.maxValue || !stepMatches(rawOut, field.spec.intField.minValue, field.spec.intField.step)) {
                snprintf(error, errorLen, "%s is out of range.", field.label);
                return false;
            }
            snprintf(normalized, normalizedLen, "%ld", static_cast<long>(rawOut));
            break;
        case APP_CFG_DECIMAL:
            if (!parseDecimalRaw(submitted, field.spec.decimalField.scale, rawOut) ||
                rawOut < field.spec.decimalField.minRawValue || rawOut > field.spec.decimalField.maxRawValue ||
                !stepMatches(rawOut, field.spec.decimalField.minRawValue, field.spec.decimalField.stepRaw)) {
                snprintf(error, errorLen, "%s is out of range.", field.label);
                return false;
            }
            formatDecimalRaw(rawOut, field.spec.decimalField.scale, normalized, normalizedLen);
            break;
        case APP_CFG_BOOL:
            boolOut = submitted && strcmp(submitted, "1") == 0;
            strlcpy(normalized, boolOut ? "true" : "false", normalizedLen);
            break;
        case APP_CFG_ENUM:
            if (!submitted || !enumValueAllowed(field.spec.enumField, submitted)) {
                snprintf(error, errorLen, "%s has an invalid option.", field.label);
                return false;
            }
            strlcpy(normalized, submitted, normalizedLen);
            break;
    }
    if (field.validate) {
        Esp32BaseAppConfig::FieldRef ref = makeFieldRef(field);
        Esp32BaseAppConfig::FieldValue value = makeFieldValue(field, normalized, rawOut, boolOut);
        if (!field.validate(ref, value, error, errorLen)) {
            if (!error[0]) {
                snprintf(error, errorLen, "%s is invalid.", field.label);
            }
            return false;
        }
    }
    return true;
}

void sendAppConfigScript() {
    sendChunk("<script>"
              "function acVal(e){return e.type=='checkbox'?(e.checked?'true':'false'):e.value;}"
              "function acText(e){if(e.tagName=='SELECT')return e.options[e.selectedIndex]?e.options[e.selectedIndex].text:e.value;if(e.type=='checkbox')return e.checked?'Enabled':'Disabled';return e.value;}"
              "function acEsc(s){return String(s).replace(/[&<>\"']/g,function(c){return {'&':'&amp;','<':'&lt;','>':'&gt;','\"':'&quot;',\"'\":'&#39;'}[c];});}"
              "function acBuild(f){var rows='',n=0,g='',snap=[];f.querySelectorAll('[data-ac]').forEach(function(e){var a=e.dataset.initial||'',b=acVal(e),eg=e.dataset.group||'';snap.push([e.name,b]);if(a!=b){if(eg!=g){g=eg;rows+='<tr class=\"acgroup\"><th colspan=\"3\">'+acEsc(g)+'</th></tr>';}n++;rows+='<tr><td>'+acEsc(e.dataset.label)+'</td><td>'+acEsc(e.dataset.initialText||a)+'</td><td>'+acEsc(acText(e))+'</td></tr>';}});return {rows:rows,n:n,snap:JSON.stringify(snap)};}"
              "function acConfirm(f){var r=acBuild(f);if(!r.n){alert('No App Config changes.');return false;}var b=document.getElementById('acbox'),t=document.getElementById('acrows'),s=document.getElementById('acsavebar');if(!f.dataset.confirmed){t.innerHTML=r.rows;f.dataset.snapshot=r.snap;b.style.display='block';if(s)s.style.display='none';b.scrollIntoView({block:'nearest'});return false;}if(f.dataset.snapshot!=r.snap){delete f.dataset.confirmed;t.innerHTML=r.rows;f.dataset.snapshot=r.snap;b.style.display='block';alert('App Config changed. Review changes again.');return false;}return once(f);}"
              "function acCancel(f){f=f||document.querySelector('form');var b=document.getElementById('acbox'),s=document.getElementById('acsavebar');if(f){delete f.dataset.confirmed;delete f.dataset.snapshot;}b.style.display='none';if(s)s.style.display='block';}"
              "function acDirty(f){if(f.dataset.snapshot||f.dataset.confirmed)acCancel(f);}"
              "function acSubmit(f){f.dataset.confirmed='1';if(f.requestSubmit){f.requestSubmit();}else{var b=f.querySelector('[type=submit]');if(b)b.click();}}"
              "</script>");
}

void sendAppConfigTopMessage() {
    if (g_server.hasArg("saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "App Config saved");
    } else if (g_server.hasArg("partial")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Some App Config values were not saved");
    } else if (g_server.hasArg("restart")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "App Config saved", "Restart the device for marked values to take effect.");
    } else if (g_server.hasArg("stale")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Config page was stale", "Reload and try again.");
    }
}

void sendAppConfigPendingRestartNotice() {
    if (!hasAppConfigPendingRestart()) {
        return;
    }
    sendChunk("<section class='panel pendingbox'><h2>Restart required</h2><p class='muted'>Some saved App Config values take effect after restart.</p><div class='tablewrap'><table><thead><tr><th>Parameter</th><th>Running</th><th>Saved</th></tr></thead><tbody>");
    for (uint8_t i = 0; i < ESP32BASE_APP_CONFIG_MAX_FIELDS; ++i) {
        const AppConfigPendingRestartSlot& slot = g_appConfigPendingRestart[i];
        if (!slot.active || slot.fieldIndex >= g_appConfigFieldCount) {
            continue;
        }
        const AppConfigFieldSlot& field = g_appConfigFields[slot.fieldIndex];
        char oldText[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
        char newText[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
        char display[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
        int32_t raw = 0;
        bool boolean = false;
        switch (field.type) {
            case APP_CFG_INT:
                snprintf(oldText, sizeof(oldText), "%ld", static_cast<long>(slot.oldRaw));
                break;
            case APP_CFG_DECIMAL:
                formatDecimalRaw(slot.oldRaw, field.spec.decimalField.scale, oldText, sizeof(oldText));
                break;
            case APP_CFG_BOOL:
                strlcpy(oldText, slot.oldBool ? "Enabled" : "Disabled", sizeof(oldText));
                break;
            case APP_CFG_STRING:
            case APP_CFG_ENUM:
                if (slot.oldTextUnavailable) {
                    strlcpy(oldText, "unavailable", sizeof(oldText));
                } else {
                    appConfigDisplayText(field, slot.oldText ? slot.oldText : "", false, oldText, sizeof(oldText));
                }
                break;
        }
        readAppConfigValue(field, newText, sizeof(newText), raw, boolean);
        appConfigDisplayText(field, newText, boolean, display, sizeof(display));
        sendChunk("<tr><td>");
        sendEscapedHtmlChunk(field.label);
        sendChunk("</td><td>");
        sendEscapedHtmlChunk(oldText);
        sendChunk("</td><td>");
        sendEscapedHtmlChunk(display);
        sendChunk("</td></tr>");
    }
    sendChunk("</tbody></table></div></section>");
}

