tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
void sendAppConfigPage(const char* errorMessage = nullptr) {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    g_pageHeadProgmem = WEB_APPCFG_STYLE;
    Esp32BaseWeb::sendHeader(g_appConfigTitle);
    sendAppConfigScript();
    sendChunk("<div class='appcfg'>");
    Esp32BaseWeb::sendPageTitle(g_appConfigTitle, "Application configuration values stored by Esp32Base.");
    sendAppConfigTopMessage();
    sendAppConfigPendingRestartNotice();
    if (errorMessage && errorMessage[0]) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "App Config was not saved", errorMessage);
    }
    if (g_appConfigGroupCount == 0 || g_appConfigFieldCount == 0) {
        sendChunk("<section class='panel actionpanel'><h2>No App Config fields</h2><p class='muted'>No application configuration values are registered by the app.</p></section>");
        sendChunk("</div>");
        Esp32BaseWeb::sendFooter();
        return;
    }
    char buf[32];
    sendChunk("<form method='post' action='/esp32base/app-config' onsubmit='return acConfirm(this)' oninput='acDirty(this)' onchange='acDirty(this)'><input type='hidden' name='rev' value='");
    snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(g_appConfigRevision));
    sendEscapedHtmlChunk(buf);
    sendChunk("'>");
    for (uint8_t g = 0; g < g_appConfigGroupCount; ++g) {
        sendChunk("<section class='panel'><h2>");
        sendEscapedHtmlChunk(g_appConfigGroups[g].title);
        sendChunk("</h2>");
        for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
            const AppConfigFieldSlot& field = g_appConfigFields[i];
            if (strcmp(field.groupId, g_appConfigGroups[g].id) != 0) {
                continue;
            }
            char value[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
            int32_t raw = 0;
            bool boolean = false;
            readAppConfigValue(field, value, sizeof(value), raw, boolean);
            char name[8];
            appConfigFieldName(i, name, sizeof(name));
            sendChunk("<div class='acfield'><label for='");
            sendEscapedHtmlChunk(name);
            sendChunk("'>");
            sendEscapedHtmlChunk(field.label);
            if (field.restartRequired) {
                sendChunk(" <span class='tag warn restart'>restart</span>");
            }
            sendChunk("</label>");
            if (field.type == APP_CFG_BOOL) {
                sendChunk("<label><input id='");
                sendEscapedHtmlChunk(name);
                sendChunk("' type='checkbox' name='");
                sendEscapedHtmlChunk(name);
                sendChunk("' value='1' data-ac='1' data-label='");
                sendEscapedHtmlChunk(field.label);
                sendChunk("' data-group='");
                sendEscapedHtmlChunk(g_appConfigGroups[g].title);
                sendChunk("' data-initial='");
                sendEscapedHtmlChunk(boolean ? "true" : "false");
                sendChunk("' data-initial-text='");
                sendEscapedHtmlChunk(boolean ? "Enabled" : "Disabled");
                sendChunk("'");
                if (boolean) {
                    sendChunk(" checked");
                }
                sendChunk("> Enabled</label>");
            } else if (field.type == APP_CFG_ENUM) {
                sendChunk("<select id='");
                sendEscapedHtmlChunk(name);
                sendChunk("' name='");
                sendEscapedHtmlChunk(name);
                sendChunk("' data-ac='1' data-label='");
                sendEscapedHtmlChunk(field.label);
                sendChunk("' data-group='");
                sendEscapedHtmlChunk(g_appConfigGroups[g].title);
                sendChunk("' data-initial='");
                sendEscapedHtmlChunk(value);
                sendChunk("' data-initial-text='");
                for (uint8_t o = 0; o < field.spec.enumField.optionCount; ++o) {
                    const Esp32BaseAppConfig::EnumOption& opt = field.spec.enumField.options[o];
                    if (strcmp(value, opt.value) == 0) {
                        sendEscapedHtmlChunk(opt.label);
                        break;
                    }
                }
                sendChunk("'>");
                for (uint8_t o = 0; o < field.spec.enumField.optionCount; ++o) {
                    const Esp32BaseAppConfig::EnumOption& opt = field.spec.enumField.options[o];
                    sendChunk("<option value='");
                    sendEscapedHtmlChunk(opt.value);
                    sendChunk("'");
                    if (strcmp(value, opt.value) == 0) {
                        sendChunk(" selected");
                    }
                    sendChunk(">");
                    sendEscapedHtmlChunk(opt.label);
                    sendChunk("</option>");
                }
                sendChunk("</select>");
            } else {
                sendChunk("<div class='acrow'><input id='");
                sendEscapedHtmlChunk(name);
                sendChunk("' name='");
                sendEscapedHtmlChunk(name);
                sendChunk("' data-ac='1' data-label='");
                sendEscapedHtmlChunk(field.label);
                sendChunk("' data-group='");
                sendEscapedHtmlChunk(g_appConfigGroups[g].title);
                sendChunk("' data-initial='");
                sendEscapedHtmlChunk(value);
                sendChunk("' value='");
                sendEscapedHtmlChunk(value);
                sendChunk("'");
                if (field.type == APP_CFG_STRING) {
                    snprintf(buf, sizeof(buf), "%u", field.spec.stringField.maxLength);
                    sendChunk(" maxlength='");
                    sendEscapedHtmlChunk(buf);
                    sendChunk("'");
                } else {
                    sendChunk(" type='number'");
                    if (field.type == APP_CFG_INT) {
                        sendChunk(" min='");
                        snprintf(buf, sizeof(buf), "%ld", static_cast<long>(field.spec.intField.minValue));
                        sendEscapedHtmlChunk(buf);
                        sendChunk("' max='");
                        snprintf(buf, sizeof(buf), "%ld", static_cast<long>(field.spec.intField.maxValue));
                        sendEscapedHtmlChunk(buf);
                        sendChunk("' step='");
                        snprintf(buf, sizeof(buf), "%ld", static_cast<long>(field.spec.intField.step));
                        sendEscapedHtmlChunk(buf);
                        sendChunk("'");
                    } else if (field.type == APP_CFG_DECIMAL) {
                        char num[32];
                        sendChunk(" min='");
                        formatDecimalRaw(field.spec.decimalField.minRawValue, field.spec.decimalField.scale, num, sizeof(num));
                        sendEscapedHtmlChunk(num);
                        sendChunk("' max='");
                        formatDecimalRaw(field.spec.decimalField.maxRawValue, field.spec.decimalField.scale, num, sizeof(num));
                        sendEscapedHtmlChunk(num);
                        sendChunk("' step='");
                        formatDecimalRaw(field.spec.decimalField.stepRaw, field.spec.decimalField.scale, num, sizeof(num));
                        sendEscapedHtmlChunk(num);
                        sendChunk("'");
                    }
                }
                sendChunk(">");
                if (field.unit && field.unit[0]) {
                    sendChunk("<span class='unit'>");
                    sendEscapedHtmlChunk(field.unit);
                    sendChunk("</span>");
                }
                sendChunk("</div>");
            }
            if (field.help && field.help[0]) {
                sendChunk("<p class='help'>");
                sendEscapedHtmlChunk(field.help);
                sendChunk("</p>");
            }
            sendChunk("</div>");
        }
        sendChunk("</section>");
    }
    sendChunk("<div id='acbox' class='confirmbox'><h2>Confirm changes</h2><p class='reviewhint'>Review the changed values before saving.</p><div class='tablewrap'><table><thead><tr><th>Parameter</th><th>Old</th><th>New</th></tr></thead><tbody id='acrows'></tbody></table></div><div class='actions'><input type='button' value='Confirm Save' onclick='acSubmit(this.form)'> <input class='cancelbtn' type='button' value='Cancel' onclick='acCancel(this.form)'></div></div><div id='acsavebar' class='actions'><input type='submit' value='Save App Config'></div></form></div>");
    Esp32BaseWeb::sendFooter();
}

bool validateAllSubmitted(char* error, size_t errorLen) {
    char submitted[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char normalized[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        const AppConfigFieldSlot& field = g_appConfigFields[i];
        if (!getSubmittedRaw(field, i, submitted, sizeof(submitted))) {
            snprintf(error, errorLen, "%s is missing.", field.label);
            return false;
        }
        int32_t raw = 0;
        bool boolean = false;
        if (!validateSubmittedField(field, submitted, normalized, sizeof(normalized), raw, boolean, error, errorLen)) {
            return false;
        }
    }
    if (g_appConfigPageValidate) {
        g_appConfigSubmitContext = true;
        const bool ok = g_appConfigPageValidate(error, errorLen);
        g_appConfigSubmitContext = false;
        if (!ok) {
            if (!error[0]) {
                strlcpy(error, "App Config is invalid.", errorLen);
            }
            return false;
        }
    }
    return true;
}

bool writeSubmittedField(const AppConfigFieldSlot& field, uint8_t index, Esp32BaseAppConfig::SaveSummary& summary) {
    char submitted[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char normalized[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char oldText[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char error[128] = "";
    int32_t newRaw = 0;
    int32_t oldRaw = 0;
    bool newBool = false;
    bool oldBool = false;
    getSubmittedRaw(field, index, submitted, sizeof(submitted));
    validateSubmittedField(field, submitted, normalized, sizeof(normalized), newRaw, newBool, error, sizeof(error));
    readAppConfigValue(field, oldText, sizeof(oldText), oldRaw, oldBool);
    bool changed = false;
    bool ok = true;
    switch (field.type) {
        case APP_CFG_STRING:
        case APP_CFG_ENUM:
            changed = strcmp(oldText, normalized) != 0;
            if (changed) {
                ok = Esp32BaseConfig::setStr(field.ns, field.key, normalized);
            }
            break;
        case APP_CFG_INT:
        case APP_CFG_DECIMAL:
            changed = oldRaw != newRaw;
            if (changed) {
                ok = Esp32BaseConfig::setInt(field.ns, field.key, newRaw);
            }
            break;
        case APP_CFG_BOOL:
            changed = oldBool != newBool;
            if (changed) {
                ok = Esp32BaseConfig::setBool(field.ns, field.key, newBool);
            }
            break;
    }
    if (!changed) {
        return true;
    }
    summary.changedCount++;
    if (!ok) {
        summary.failedCount++;
        return false;
    }
    summary.savedCount++;
    summary.restartRequired = summary.restartRequired || field.restartRequired;
    updateAppConfigPendingRestart(field, index, oldText, oldRaw, oldBool, normalized, newRaw, newBool);
    if (g_appConfigChangeCallback) {
        Esp32BaseAppConfig::Change change;
        change.field = makeFieldRef(field);
        change.oldValue = makeFieldValue(field, oldText, oldRaw, oldBool);
        change.newValue = makeFieldValue(field, normalized, newRaw, newBool);
        g_appConfigChangeCallback(change);
    }
    return true;
}

void handleAppConfigSubmit() {
    markRequest();
    if (!ensurePostAllowed("app_config")) {
        return;
    }
    int32_t rev = 0;
    if (!g_server.hasArg("rev") || !parseStrictInt32(g_server.arg("rev").c_str(), rev) || static_cast<uint32_t>(rev) != g_appConfigRevision) {
        redirectSeeOther("/esp32base/app-config?stale=1");
        return;
    }
    char error[128] = "";
    if (!validateAllSubmitted(error, sizeof(error))) {
        sendAppConfigPage(error);
        return;
    }
    Esp32BaseAppConfig::SaveSummary summary = {};
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        writeSubmittedField(g_appConfigFields[i], i, summary);
    }
    if (summary.savedCount > 0) {
        g_appConfigRevision++;
    }
    if (g_appConfigSaveCallback) {
        g_appConfigSaveCallback(summary);
    }
    if (summary.failedCount > 0) {
        redirectSeeOther("/esp32base/app-config?partial=1");
    } else if (summary.restartRequired) {
        redirectSeeOther("/esp32base/app-config?restart=1");
    } else {
        redirectSeeOther(summary.savedCount > 0 ? "/esp32base/app-config?saved=1" : "/esp32base/app-config");
    }
}

void handleAppConfigPage() {
    sendAppConfigPage();
}
#endif

void handleRestart() {
    markRequest();
    if (!ensurePostAllowed("restart")) {
        return;
    }
    g_server.send(200, "text/plain", "restarting");
    delay(100);
    Esp32BaseSystem::restart("web");
}

void handleToolsPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader(g_builtinLabels[Esp32BaseWeb::BUILTIN_TOOLS]);
    Esp32BaseWeb::sendPageTitle(g_builtinLabels[Esp32BaseWeb::BUILTIN_TOOLS], "Low-frequency device settings and maintenance actions.");
    if (g_server.hasArg("formatted")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "LittleFS formatted", "FileLog mode was reloaded.");
    } else if (g_server.hasArg("logs_cleared")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Logs cleared");
    } else if (g_server.hasArg("filelog_saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "File log mode saved");
    } else if (g_server.hasArg("footer_saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Footer bar mode saved");
    } else if (g_server.hasArg("watchdog_trip_reset")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Watchdog trip reset");
    } else if (g_server.hasArg("error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "System action failed", g_server.arg("error").c_str());
    } else if (g_server.hasArg("restarting")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Restart requested", "Device is restarting. Please wait a few seconds, then reload.");
    }
    if (g_server.hasArg("hostname_saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Hostname saved", "Restart the device for mDNS, OTA and Web discovery to use it.");
    } else if (g_server.hasArg("hostname_error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Hostname was not saved", g_server.arg("hostname_error").c_str());
    }
    sendChunk("<section class='panel actionpanel'><h2>System settings</h2><div class='toollinks'>");
#if ESP32BASE_ENABLE_APP_CONFIG
    Esp32BaseWeb::sendInfoRowCompactLink("App Config", "Application configuration values registered by the app.", nullptr, "/esp32base/app-config", "Open", Esp32BaseWeb::UI_INFO);
#endif
    Esp32BaseWeb::sendInfoRowCompactLink("WiFi Setup", "Stored credentials used by station mode and WiFi recovery.", nullptr, "/esp32base/wifi", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendInfoRowCompactLink("Web Auth", "HTTP Basic Auth credentials for built-in routes.", nullptr, "/esp32base/auth", "Open", Esp32BaseWeb::UI_INFO);
#if ESP32BASE_ENABLE_OTA
    Esp32BaseWeb::sendInfoRowCompactLink("Firmware OTA", "Authenticated firmware upload endpoint.", nullptr, "/esp32base/ota", "Open", Esp32BaseWeb::UI_INFO);
#endif
#if ESP32BASE_ENABLE_FS
    Esp32BaseWeb::sendInfoRowCompactLink("File system", "Read-only LittleFS inventory and size summary.", nullptr, "/esp32base/fs", "Open", Esp32BaseWeb::UI_INFO);
#endif
    sendChunk("</div></section>");
    char storedHostname[64] = "";
    const bool hasStoredHostname = loadStoredHostname(storedHostname, sizeof(storedHostname));
    sendChunk("<div class='toolgrid'>");
    sendChunk("<section class='panel formpanel hostpanel'><h2>Hostname</h2><div class='hostfacts'><span><b>Current</b>");
    sendEscapedHtmlChunk(Esp32Base::hostname());
    sendChunk("</span><span><b>Default</b>");
    sendEscapedHtmlChunk(Esp32Base::defaultHostname());
    sendChunk("</span><span><b>Stored</b>");
    sendEscapedHtmlChunk(hasStoredHostname && storedHostname[0] ? storedHostname : "-");
    sendChunk("</span><span><b>Restart</b>");
    if (hostnameRestartRequired(storedHostname)) {
        sendChunk("<span class='tag warn'>required</span>");
    } else {
        sendChunk("no");
    }
    sendChunk("</span></div><form class='editform' method='post' action='/esp32base/tools/hostname' onsubmit=\"var h=this.hostname.value.trim();if(!/^[a-z0-9](?:[a-z0-9-]{0,30}[a-z0-9])?$/.test(h)){alert('Use 1-32 lowercase letters, digits and hyphen. No leading or trailing hyphen. Do not include .local.');return false;}this.hostname.value=h;return once(this);\"><div class='hostedit'>");
    sendChunk("<div class='field'><label for='host'>New hostname</label><input id='host' name='hostname' maxlength='32' autocomplete='off' value='");
    sendEscapedHtmlChunk(hasStoredHostname && storedHostname[0] ? storedHostname : Esp32Base::hostname());
    sendChunk("'><small>Saved hostname takes effect after restart.</small></div><div class='actions'><input type='submit' value='Save Hostname'></div></div></form></section>");
    sendChunk("<section class='panel actionpanel'><h2>Footer bar</h2><div class='tablewrap'><table class='kv'>");
    sendInfoRow("Current mode", Esp32BaseWeb::footerBarModeName());
    sendChunk("</table></div><form method='post' action='/esp32base/tools/footer-bar' onsubmit=\"return once(this)\"><div class='radioopts'>");
    sendFooterBarModeOption("off", "Off", Esp32BaseWeb::FOOTER_BAR_OFF);
    sendFooterBarModeOption("status", "Status only", Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY);
    sendFooterBarModeOption("full", "Links + status", Esp32BaseWeb::FOOTER_BAR_FULL);
    sendChunk("</div><p class='muted'>Controls the compact bottom bar on built-in and app pages.</p><div class='actions'><input type='submit' value='Save Footer Bar'></div></form></section>");
#if ESP32BASE_ENABLE_FILELOG
    sendChunk("<section class='panel actionpanel'><h2>File log</h2><div class='tablewrap'><table class='kv'>");
    sendInfoRow("Current mode", Esp32BaseFileLog::modeName());
    sendInfoRow("Path", Esp32BaseFileLog::path());
    sendChunk("</table></div><form method='post' action='/esp32base/tools/filelog' onsubmit=\"return once(this)\"><div class='radioopts'>");
    sendFileLogModeOption("off", "Off", Esp32BaseFileLog::OFF);
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_ERROR
    sendFileLogModeOption("error", "ERROR", Esp32BaseFileLog::ERROR);
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_WARN
    sendFileLogModeOption("warn", "WARN", Esp32BaseFileLog::WARN);
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_INFO
    sendFileLogModeOption("info", "INFO", Esp32BaseFileLog::INFO);
#endif
    sendChunk("</div><p class='muted'>File log mode is capped by the build log level.</p><div class='actions'><input type='submit' value='Save File Log'></div></form></section>");
#else
    sendChunk("<section class='panel actionpanel'><h2>File log</h2><p class='muted'>File log is unavailable in this profile.</p></section>");
#endif
#if ESP32BASE_ENABLE_WATCHDOG
    sendWatchdogPanel();
#endif
    sendChunk("</div><div class='toolgrid'>");
    sendChunk("<section class='panel dangerpanel'><h2>Restart device</h2><p class='muted'>Restart the device through the normal lifecycle path.</p><form method='post' action='/esp32base/tools/reboot' onsubmit=\"return confirm('Reboot device now?')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Restart device'></div></form></section>");
#if ESP32BASE_ENABLE_FILELOG
    sendChunk("<section class='panel dangerpanel'><h2>Clear logs</h2><p class='dangertext'>Delete all file log contents. Runtime settings and WiFi credentials are not changed.</p><form method='post' action='/esp32base/tools/logs-clear' onsubmit=\"return confirm('Clear log files?')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Clear Logs'></div></form></section>");
#else
    sendChunk("<section class='panel actionpanel'><h2>Clear logs</h2><p class='muted'>File log is unavailable in this profile.</p></section>");
#endif
#if ESP32BASE_ENABLE_FS
    sendChunk("<section class='panel dangerpanel'><h2>Format LittleFS</h2><p class='dangertext'>This deletes logs and all files stored in LittleFS. WiFi, Web Auth and NVS config are not cleared.</p><form method='post' action='/esp32base/tools/format-fs' onsubmit=\"return confirm('Format LittleFS? This deletes logs and all files stored in LittleFS.')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Format LittleFS'></div></form></section>");
#else
    sendChunk("<section class='panel actionpanel'><h2>Format LittleFS</h2><p class='muted'>LittleFS is unavailable in this profile.</p></section>");
#endif
    sendChunk("</div>");
    Esp32BaseWeb::sendFooter();
}

void handleToolsFileLogPost() {
    markRequest();
    if (!ensurePostAllowed("tools_filelog")) {
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::Mode mode = Esp32BaseFileLog::OFF;
    if (!fileLogModeFromArg(g_server.arg("mode"), mode)) {
        ESP32BASE_LOG_W("web", "filelog_mode_rejected source=tools value=%s", g_server.arg("mode").c_str());
        redirectSeeOther("/esp32base/tools?error=filelog_invalid_mode");
        return;
    }
    ESP32BASE_LOG_W("web", "filelog_mode_requested source=tools from=%s to=%s",
                    Esp32BaseFileLog::modeName(),
                    fileLogModeName(mode));
    const bool ok = Esp32BaseFileLog::setMode(mode);
    redirectSeeOther(ok ? "/esp32base/tools?filelog_saved=1" : "/esp32base/tools?error=filelog_save_failed");
#else
    redirectSeeOther("/esp32base/tools?error=filelog_unavailable");
#endif
}

void handleToolsFooterBarPost() {
    markRequest();
    if (!ensurePostAllowed("tools_footer_bar")) {
        return;
    }
    Esp32BaseWeb::FooterBarMode mode = Esp32BaseWeb::FOOTER_BAR_FULL;
    if (!footerBarModeFromArg(g_server.arg("mode"), mode)) {
        ESP32BASE_LOG_W("web", "footer_bar_mode_rejected source=tools value=%s", g_server.arg("mode").c_str());
        redirectSeeOther("/esp32base/tools?error=footer_bar_invalid_mode");
        return;
    }
    ESP32BASE_LOG_W("web", "footer_bar_mode_requested source=tools from=%s to=%s",
                    Esp32BaseWeb::footerBarModeName(),
                    footerBarModeName(mode));
    const bool ok = Esp32BaseWeb::setFooterBarMode(mode);
    redirectSeeOther(ok ? "/esp32base/tools?footer_saved=1" : "/esp32base/tools?error=footer_bar_save_failed");
}

