tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
#if ESP32BASE_ENABLE_WIFI
    sendStatusSectionStart("Network");
    sendInfoRowStart("WiFi");
    sendEscapedHtmlChunk(Esp32BaseWiFi::stateName());
    if (Esp32BaseWiFi::ssid()[0]) {
        sendChunk(" / ");
        sendEscapedHtmlChunk(Esp32BaseWiFi::ssid());
    }
    sendInfoRowEnd();
    char ip[24] = "-";
    if (Esp32BaseWiFi::isConnected()) {
        Esp32BaseWiFi::ip(ip, sizeof(ip));
    }
    sendInfoRow("IP", ip);
    if (Esp32BaseWiFi::isConnected()) {
        snprintf(value, sizeof(value), "%ld dBm", static_cast<long>(Esp32BaseWiFi::rssi()));
    } else {
        strlcpy(value, "-", sizeof(value));
    }
    sendInfoRow("RSSI", value);
    sendInfoRow("Power save", Esp32BaseWiFi::powerSave() ? "on" : "off");
    sendInfoRow("STA MAC", WiFi.macAddress().c_str());
    sendInfoRow("AP MAC", WiFi.softAPmacAddress().c_str());
    sendStatusSectionEnd();
#endif

    sendStatusSectionStart("Runtime Health");
    sendInfoRowStart("Heap");
    sendSubmetricsStart();
    sendSubmetric("Free", freeHeap);
    sendSubmetric("Min", minHeap);
    sendSubmetric("Max alloc", maxAllocHeap);
    sendSubmetric("Total", totalHeap);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#if ESP32BASE_ENABLE_WATCHDOG
    const WatchdogTripState watchdogTrip = readWatchdogTripState();
    char tripResetAt[32];
    formatWatchdogTripResetAt(watchdogTrip, tripResetAt, sizeof(tripResetAt));
    sendInfoRowStart("Watchdog");
    sendStatusTag(Esp32BaseWeb::UI_OK, "enabled");
    sendSubmetricsStart();
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(watchdogTrip.lifetime));
    sendSubmetric("Lifetime resets", value);
    if (watchdogTrip.invalidBase) {
        strlcpy(value, "invalid baseline", sizeof(value));
    } else {
        snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(watchdogTrip.trip));
    }
    sendSubmetric("Trip resets", value);
    sendSubmetric("Trip reset at", tripResetAt);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot time = Esp32BaseNtp::snapshot();
    sendInfoRowStart("NTP time");
    if (!Esp32BaseNtp::isStarted()) {
        sendStatusTag(Esp32BaseWeb::UI_NEUTRAL, "not started");
    } else if (time.synced) {
        sendStatusTag(Esp32BaseWeb::UI_OK, "synced");
    } else {
        sendStatusTag(Esp32BaseWeb::UI_WARN, "pending");
    }
    if (time.synced && Esp32BaseNtp::formatTime(value, sizeof(value), "%Y-%m-%d %H:%M:%S")) {
        sendChunk("<br>");
        sendEscapedHtmlChunk(value);
    }
    sendInfoRowEnd();
#endif
    sendInfoRowStart("Last reset");
    sendEscapedHtmlChunk(Esp32BaseSystem::resetReason());
    sendChunk(" / ");
    sendEscapedHtmlChunk(Esp32BaseSystem::resetReasonText());
    sendInfoRowEnd();
    sendInfoRowStart("Last wake");
    sendEscapedHtmlChunk(Esp32BaseSystem::wakeReason());
    sendChunk(" / ");
    sendEscapedHtmlChunk(Esp32BaseSystem::wakeReasonText());
    sendInfoRowEnd();
    sendStatusSectionEnd();

#if ESP32BASE_ENABLE_FS || ESP32BASE_ENABLE_FILELOG
    sendStatusSectionStart("Storage & Logs");
#if ESP32BASE_ENABLE_FS
    if (Esp32BaseFs::isReady()) {
        FsScan fsScan;
        if (scanFs(fsScan)) {
            sendFsSummaryRows(fsScan);
        } else {
            sendTaggedInfoRow("FS", "scan failed", Esp32BaseWeb::UI_WARN);
        }
    } else {
        sendTaggedInfoRow("FS", "unavailable", Esp32BaseWeb::UI_WARN);
    }
#endif
#if ESP32BASE_ENABLE_FILELOG
    sendInfoRowStart("File log");
    sendStatusTag(Esp32BaseFileLog::isEnabled() ? Esp32BaseWeb::UI_OK : Esp32BaseWeb::UI_NEUTRAL,
                  Esp32BaseFileLog::isEnabled() ? "enabled" : "disabled");
    if (Esp32BaseFileLog::isEnabled()) {
        char sizeBuf[48];
        formatReadableBytes(Esp32BaseFileLog::size(), sizeBuf, sizeof(sizeBuf));
        uint64_t logUsedBytes = 0;
        for (uint8_t i = 0; i < Esp32BaseFileLog::rotateFiles(); ++i) {
            logUsedBytes += Esp32BaseFileLog::segmentSize(i);
        }
        char logUsed[48];
        char logLimit[48];
        formatReadableBytes(logUsedBytes, logUsed, sizeof(logUsed));
        formatReadableBytes(static_cast<uint64_t>(Esp32BaseFileLog::maxBytes()) * Esp32BaseFileLog::rotateFiles(), logLimit, sizeof(logLimit));
        sendSubmetricsStart();
        sendSubmetric("Log level", Esp32BaseFileLog::modeName());
        sendSubmetric("Current file", sizeBuf);
        sendSubmetric("Used", logUsed);
        sendSubmetric("Limit", logLimit);
        sendSubmetricsEnd();
    }
    sendInfoRowEnd();
    if (Esp32BaseFileLog::isEnabled()) {
        sendInfoRow("Log path", Esp32BaseFileLog::path());
    }
#endif
    sendStatusSectionEnd();
#endif

    sendStatusSectionStart("Firmware & OTA");
    sendInfoRow("Current firmware", sketch);
    sendInfoRow("Running slot", runningSlot);
    sendInfoRow("OTA target slot", otaTargetSlot);
    sendInfoRow("Max OTA upload", otaTargetSize);
    sendInfoRowStart("OTA headroom");
    sendEscapedHtmlChunk(otaHeadroom);
    sendChunk("<br><span class='info'>target slot - current sketch</span>");
    sendInfoRowEnd();
#if ESP32BASE_ENABLE_OTA
    sendInfoRow("Rollback", Esp32BaseOta::isRollbackPossible() ? "possible" : "not possible");
    if (Esp32BaseOta::lastError()[0]) {
        sendInfoRow("Last OTA error", Esp32BaseOta::lastError());
    }
#endif
    sendStatusSectionEnd();

    char mac[18];
    sendStatusSectionStart("Hardware");
    sendInfoRow("Chip", ESP.getChipModel());
    snprintf(value, sizeof(value), "%d", ESP.getChipRevision());
    sendInfoRow("Revision", value);
    snprintf(value, sizeof(value), "%u MHz", static_cast<unsigned>(ESP.getCpuFreqMHz()));
    sendInfoRow("CPU", value);
    sendInfoRow("SDK", ESP.getSdkVersion());
    sendInfoRow("Flash chip", flash);
    if (ESP.getPsramSize() > 0) {
        char psramTotal[48];
        char psramFree[48];
        formatReadableBytes(ESP.getPsramSize(), psramTotal, sizeof(psramTotal));
        formatReadableBytes(ESP.getFreePsram(), psramFree, sizeof(psramFree));
        snprintf(value, sizeof(value), "free %s, total %s", psramFree, psramTotal);
        sendInfoRow("PSRAM", value);
    }
    formatMac(ESP.getEfuseMac(), mac, sizeof(mac));
    sendInfoRow("eFuse MAC", mac);
    sendStatusSectionEnd();
    sendChunk("</div>");

    if (g_homeMode == Esp32BaseWeb::HOME_ESP32BASE && appNavCount() > 0) {
        sendChunk("<section class='panel appsection'><h2>Application</h2>");
        sendAppLinks(true, nullptr);
        sendChunk("</section>");
    }

    sendPartitionTable();
    Esp32BaseWeb::sendFooter();
}

#if ESP32BASE_ENABLE_FS
void handleFsPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    const bool manage = fsManageMode();
    Esp32BaseWeb::sendHeader("File system");
    Esp32BaseWeb::sendPageTitle("File system", "Read-only LittleFS inventory and storage usage.");
    if (g_server.hasArg("deleted")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "File deleted");
    } else if (g_server.hasArg("error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "File action failed", g_server.arg("error").c_str());
    }
    if (!Esp32BaseFs::isReady()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "LittleFS unavailable");
        Esp32BaseWeb::sendFooter();
        return;
    }
    FsScan scan;
    if (!scanFs(scan)) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "LittleFS scan failed");
        Esp32BaseWeb::sendFooter();
        return;
    }
    if (fsInternalUsageHigh(scan)) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "Internal FS usage is high", "Visible files are much smaller than FS used. Delete may not fully recover space; download files you need and format LittleFS if free space stays low.");
    }
    if (manage) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "File management mode", "Only single-file delete is available. Directories, batch actions and edit are intentionally not provided.");
        sendChunk("<p class='statusline'><a class='btnlink secondary' href='/esp32base/fs'>View only</a></p>");
    } else {
        sendChunk("<p class='statusline'><a class='btnlink warn' href='/esp32base/fs?manage=1'>Manage files</a></p>");
    }
    sendChunk("<section class='panel statuspage'><h2>Summary</h2><div class='tablewrap'>");
    sendFsSummaryTable(scan);
    sendChunk("</div></section>");

    sendChunk("<section class='panel statuspage'><h2>Largest files</h2><div class='tablewrap'><table class='part'><tr><th>Path</th><th>Size</th></tr>");
    if (scan.topCount == 0) {
        sendChunk("<tr><td colspan='2'>No files</td></tr>");
    } else {
        char sizeBuf[48];
        const uint8_t count = scan.topCount < FS_TOP_MAX ? scan.topCount : FS_TOP_MAX;
        for (uint8_t i = 0; i < count; ++i) {
            formatReadableBytes(scan.top[i].size, sizeBuf, sizeof(sizeBuf));
            sendChunk("<tr><td>");
            sendEscapedHtmlChunk(scan.top[i].path);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(sizeBuf);
            sendChunk("</td></tr>");
        }
    }
    sendChunk("</table></div></section>");

    sendChunk("<section class='panel statuspage'><h2>File tree</h2><div class='tablewrap'><table class='part'><tr><th>Path</th><th>Type</th><th>Size</th><th>Action</th></tr>");
    FsScan treeScan;
    memset(&treeScan, 0, sizeof(treeScan));
    uint16_t emittedRows = 0;
    fsWalkDir(treeScan, "/", 0, true, manage, FS_TREE_LIST_LIMIT, &emittedRows);
    if (emittedRows == 0) {
        sendChunk("<tr><td colspan='4'>No files</td></tr>");
    }
    sendChunk("</table></div>");
    if (scan.entries > FS_TREE_LIST_LIMIT) {
        sendChunk("<p class='notice warn'>File tree truncated at 128 entries.</p>");
    }
    sendChunk("</section>");
    Esp32BaseWeb::sendFooter();
}

void handleFsDownloadGet() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (!Esp32BaseFs::isReady()) {
        g_server.send(404, "text/plain", "File system unavailable");
        return;
    }
    char path[96];
    strlcpy(path, g_server.hasArg("path") ? g_server.arg("path").c_str() : "", sizeof(path));
    if (!validFsFilePath(path)) {
        g_server.send(400, "text/plain", "Invalid path");
        return;
    }
    if (Esp32BaseFs::listDir(path, fsNoopListCallback, nullptr)) {
        g_server.send(400, "text/plain", "Directory download is not supported");
        return;
    }
    File file = LittleFS.open(path, "r");
    if (!file) {
        g_server.send(404, "text/plain", "File not found");
        return;
    }
    if (file.isDirectory()) {
        file.close();
        g_server.send(400, "text/plain", "Directory download is not supported");
        return;
    }
    const size_t size = file.size();
    if (size > static_cast<size_t>(UINT32_MAX)) {
        file.close();
        g_server.send(413, "text/plain", "File too large");
        return;
    }

    uint8_t buffer[512];
    const size_t firstLen = size > 0 ? file.readBytes(reinterpret_cast<char*>(buffer), size > sizeof(buffer) ? sizeof(buffer) : size) : 0;
    if (size > 0 && firstLen == 0) {
        file.close();
        ESP32BASE_LOG_W("web", "fs_download_read_failed path=%s offset=0", path);
        g_server.send(500, "text/plain", "File read failed");
        return;
    }

