tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
    char filename[64];
    fsDownloadFilename(path, filename, sizeof(filename));
    sendResponseHeader("Cache-Control", "no-store");
    if (!beginResponse(200, "application/octet-stream", filename)) {
        file.close();
        g_server.send(500, "text/plain", "Download failed");
        return;
    }

    size_t sent = 0;
    if (firstLen > 0) {
        sendChunk(reinterpret_cast<const char*>(buffer), firstLen);
        sent = firstLen;
    }
    while (sent < size && !g_responseBroken) {
        const size_t maxLen = size - sent > sizeof(buffer) ? sizeof(buffer) : size - sent;
        const size_t readLen = file.readBytes(reinterpret_cast<char*>(buffer), maxLen);
        if (readLen == 0) {
            ESP32BASE_LOG_W("web", "fs_download_read_failed path=%s offset=%lu", path, static_cast<unsigned long>(sent));
            break;
        }
        sendChunk(reinterpret_cast<const char*>(buffer), readLen);
        sent += readLen;
        fsScanYield();
    }
    file.close();
    endResponse();
    ESP32BASE_LOG_I("web", "fs_download_requested path=%s bytes=%lu", path, static_cast<unsigned long>(sent));
}

void handleFsDeletePost() {
    markRequest();
    if (!ensurePostAllowed("fs_delete")) {
        return;
    }
    if (!Esp32BaseFs::isReady()) {
        redirectSeeOther("/esp32base/fs?manage=1&error=fs_unavailable");
        return;
    }
    char path[96];
    strlcpy(path, g_server.hasArg("path") ? g_server.arg("path").c_str() : "", sizeof(path));
    if (!validFsDeletePath(path)) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected reason=invalid_path");
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_invalid");
        return;
    }
    if (Esp32BaseFs::listDir(path, fsNoopListCallback, nullptr)) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected path=%s reason=directory", path);
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_directory");
        return;
    }
    if (Esp32BaseFs::fileSize(path) < 0) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected path=%s reason=missing", path);
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_missing");
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::flush();
#endif
    const bool ok = Esp32BaseFs::removeFile(path);
    ESP32BASE_LOG_W("web", "fs_delete_requested path=%s result=%s", path, ok ? "success" : "failed");
    redirectSeeOther(ok ? "/esp32base/fs?manage=1&deleted=1" : "/esp32base/fs?manage=1&error=delete_failed");
}
#endif

#if ESP32BASE_ENABLE_FILELOG
uint8_t selectedLogSegment() {
    if (!g_server.hasArg("segment")) {
        return 0;
    }
    const String raw = g_server.arg("segment");
    if (raw.length() == 0 || raw.length() > 3) {
        return 0;
    }
    uint16_t value = 0;
    for (size_t i = 0; i < raw.length(); ++i) {
        const char c = raw.charAt(i);
        if (c < '0' || c > '9') {
            return 0;
        }
        value = static_cast<uint16_t>(value * 10U + static_cast<uint16_t>(c - '0'));
    }
    if (value >= Esp32BaseFileLog::rotateFiles()) {
        return 0;
    }
    return static_cast<uint8_t>(value);
}

void sendRawLogChunk(const char* data, size_t len, void* user) {
    (void)user;
    sendChunk(data, len);
#if ESP32BASE_ENABLE_WATCHDOG
    Esp32BaseWatchdog::feed();
#endif
    yield();
}

void logSegmentTitle(uint8_t index, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (index == 0) {
        snprintf(out, len, "current-0");
        return;
    }
    snprintf(out, len, "history-%u", static_cast<unsigned>(index));
}

void sendLogSegmentTabs(uint8_t selected) {
    char title[16];
    char sizeBuf[48];
    char line[160];
    sendChunk("<div class='tabs'>");
    for (uint8_t i = 0; i < Esp32BaseFileLog::rotateFiles(); ++i) {
        logSegmentTitle(i, title, sizeof(title));
        formatReadableBytes(Esp32BaseFileLog::segmentSize(i), sizeBuf, sizeof(sizeBuf));
        snprintf(line, sizeof(line), "<a%s href='/esp32base/logs?segment=%u'>",
                 i == selected ? " class='active'" : "",
                 static_cast<unsigned>(i));
        sendChunk(line);
        sendChunk("<span class='segname'>");
        sendEscapedHtmlChunk(title);
        sendChunk("</span><span class='segsize'>");
        sendEscapedHtmlChunk(sizeBuf);
        sendChunk("</span></a>");
    }
    sendChunk("</div>");
}
#endif

void handleLogsPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader(g_builtinLabels[Esp32BaseWeb::BUILTIN_LOGS]);
    Esp32BaseWeb::sendPageTitle(g_builtinLabels[Esp32BaseWeb::BUILTIN_LOGS]);
    if (g_server.hasArg("cleared")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Logs cleared");
    } else if (g_server.hasArg("error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Logs action failed", g_server.arg("error").c_str());
    }
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::flush();
    char maxBuf[48];
    char totalBuf[48];
    char bufferUsed[48];
    char bufferTotal[48];
    formatReadableBytes(Esp32BaseFileLog::maxBytes(), maxBuf, sizeof(maxBuf));
    formatReadableBytes(static_cast<uint64_t>(Esp32BaseFileLog::maxBytes()) * Esp32BaseFileLog::rotateFiles(), totalBuf, sizeof(totalBuf));
    formatReadableBytes(Esp32BaseFileLog::bufferUsed(), bufferUsed, sizeof(bufferUsed));
    formatReadableBytes(Esp32BaseFileLog::bufferSize(), bufferTotal, sizeof(bufferTotal));
    char line[320];
    sendChunk("<section class='panel logpanel'><div class='tablewrap'><table class='logmeta'><tr><th>File log</th><td><b>");
    sendEscapedHtmlChunk(Esp32BaseFileLog::isEnabled() ? "enabled" : "disabled");
    sendChunk("</b></td></tr><tr><th>Path</th><td>");
    sendEscapedHtmlChunk(Esp32BaseFileLog::path());
    snprintf(line, sizeof(line), "</td></tr><tr><th>Rotation files</th><td>%u</td></tr><tr><th>Mode</th><td>%s</td></tr><tr><th>Buffer</th><td>%s / %s</td></tr><tr><th>Flush interval</th><td>%lu ms</td></tr><tr><th>Max per file</th><td>%s</td></tr><tr><th>Max total</th><td>%s</td></tr><tr><th>Segments</th><td>",
             static_cast<unsigned>(Esp32BaseFileLog::rotateFiles()),
             Esp32BaseFileLog::modeName(),
             bufferUsed,
             bufferTotal,
             static_cast<unsigned long>(Esp32BaseFileLog::flushIntervalMs()),
             maxBuf,
             totalBuf);
    sendChunk(line);
    for (int8_t i = static_cast<int8_t>(Esp32BaseFileLog::rotateFiles()) - 1; i >= 0; --i) {
        char sizeBuf[48];
        formatReadableBytes(Esp32BaseFileLog::segmentSize(static_cast<uint8_t>(i)), sizeBuf, sizeof(sizeBuf));
        snprintf(line, sizeof(line), "%s%u=%s", i == static_cast<int8_t>(Esp32BaseFileLog::rotateFiles()) - 1 ? "" : ", ", static_cast<unsigned>(i), sizeBuf);
        sendChunk(line);
    }
    const uint8_t selectedSegment = selectedLogSegment();
    sendChunk("</td></tr></table></div>");
    sendLogSegmentTabs(selectedSegment);
    snprintf(line, sizeof(line), "<p><a href='/esp32base/logs/raw?segment=%u'>Open raw log</a></p><iframe class='logframe' src='/esp32base/logs/raw?segment=%u'></iframe>",
             static_cast<unsigned>(selectedSegment),
             static_cast<unsigned>(selectedSegment));
    sendChunk(line);
    sendChunk("</section>");
#else
    sendChunk("<section class='panel actionpanel'><h2>File log unavailable</h2><p class='muted'>File log is not available in this firmware profile.</p></section>");
#endif
    Esp32BaseWeb::sendFooter();
}

void handleLogsRaw() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::flush();
    const uint8_t selectedSegment = selectedLogSegment();
    g_server.sendHeader("X-Content-Type-Options", "nosniff");
    if (!beginResponse(200, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    if (!Esp32BaseFileLog::streamSegment(selectedSegment, sendRawLogChunk)) {
        sendChunk("log unavailable\n");
    }
    endResponse();
#else
    g_server.send(404, "text/plain", "File log unavailable");
#endif
}

void handleLogsClear() {
    markRequest();
    if (!ensurePostAllowed("logs_clear")) {
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    const bool ok = Esp32BaseFileLog::clear();
    redirectSeeOther(ok ? "/esp32base/logs?cleared=1" : "/esp32base/logs?error=clear_failed");
#else
    redirectSeeOther("/esp32base/logs?error=unavailable");
#endif
}

void handleAuthPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader(g_builtinLabels[Esp32BaseWeb::BUILTIN_AUTH]);
    Esp32BaseWeb::sendPageTitle(g_builtinLabels[Esp32BaseWeb::BUILTIN_AUTH], "Update the HTTP Basic Auth credentials used by built-in routes.");
    if (g_server.hasArg("saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Auth updated", "Use the new credentials on the next auth prompt.");
    } else if (g_server.hasArg("error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Auth update failed", g_server.arg("error").c_str());
    }
    sendChunk("<section class='panel formpanel authpanel'><h2>Credentials</h2><form class='editform' method='post' action='/esp32base/auth' onsubmit=\"var f=this;function v(n){return f.elements[n].value.trim();}if(!v('current_user')||!v('current_pass')||!v('new_user')||!v('new_pass')||!v('confirm_pass')){alert('All auth fields are required');return false;}if(v('new_pass')!=v('confirm_pass')){alert('New passwords do not match');return false;}return once(this)\"><div class='fieldgrid'>");
    sendChunk("<div class='field med'><label for='current_user'>Current auth user</label><input id='current_user' name='current_user' maxlength='31' required value='");
    sendEscapedHtmlChunk(g_authUser);
    sendChunk("'></div>");
    sendChunk("<div class='field med'><label for='current_pass'>Current auth password</label><input id='current_pass' type='password' name='current_pass' maxlength='63' autocomplete='current-password' required></div>");
    sendChunk("<div class='field med'><label for='new_user'>New auth user</label><input id='new_user' name='new_user' maxlength='31' required value='");
    sendEscapedHtmlChunk(g_authUser);
    sendChunk("'></div>");
    sendChunk("<div class='field med'><label for='new_pass'>New auth password</label><input id='new_pass' type='password' name='new_pass' maxlength='63' autocomplete='new-password' required></div>");
    sendChunk("<div class='field med'><label for='confirm_pass'>Confirm new auth password</label><input id='confirm_pass' type='password' name='confirm_pass' maxlength='63' autocomplete='new-password' required></div></div>");
    sendChunk("<div class='actions'><input type='submit' value='Save Auth'></div></form></section>");
    Esp32BaseWeb::sendFooter();
}

void handleAuthSubmit() {
    markRequest();
    if (!ensurePostAllowed("auth_submit")) {
        return;
    }
    char currentUser[32];
    char currentPass[64];
    char newUser[32];
    char newPass[64];
    char confirmPass[64];
    strlcpy(currentUser, g_server.arg("current_user").c_str(), sizeof(currentUser));
    strlcpy(currentPass, g_server.arg("current_pass").c_str(), sizeof(currentPass));
    strlcpy(newUser, g_server.arg("new_user").c_str(), sizeof(newUser));
    strlcpy(newPass, g_server.arg("new_pass").c_str(), sizeof(newPass));
    strlcpy(confirmPass, g_server.arg("confirm_pass").c_str(), sizeof(confirmPass));
    if (!Esp32BaseWeb::verifyAuth(currentUser, currentPass)) {
        ESP32BASE_LOG_W("web", "auth_update_failed reason=current_auth");
        redirectSeeOther("/esp32base/auth?error=current_auth");
        return;
    }
    if (strcmp(newPass, confirmPass) != 0) {
        ESP32BASE_LOG_W("web", "auth_update_failed reason=confirm");
        redirectSeeOther("/esp32base/auth?error=confirm");
        return;
    }
    if (!Esp32BaseWeb::saveAuth(newUser, newPass)) {
        redirectSeeOther("/esp32base/auth?error=invalid_or_storage");
        return;
    }
    redirectSeeOther("/esp32base/auth?saved=1");
}
}

