tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
void Esp32BaseWeb::sendFooter() {
    sendChunk("</main>");
    if (g_systemNavMode != Esp32BaseWeb::SYSTEM_NAV_SECTION) {
        sendSystemNavSection();
    }
    switch (g_footerBarMode) {
        case Esp32BaseWeb::FOOTER_BAR_OFF:
            sendChunk("</body></html>");
            break;
        case Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY:
            sendChunk("<footer class='footerbar'><span class='heap'>");
            sendFooterStats();
            sendChunk("</span></footer></body></html>");
            break;
        case Esp32BaseWeb::FOOTER_BAR_FULL:
        default:
            if (g_systemNavMode == Esp32BaseWeb::SYSTEM_NAV_SECTION) {
                sendChunk("<footer class='footerbar'><span class='syslinks'>");
                sendSystemLinks(false, activeNavPath(true));
                sendChunk("</span><span class='heap'>");
                sendFooterStats();
                sendChunk("</span></footer></body></html>");
            } else {
                sendChunk("<div class=info>");
                sendFooterStats();
                sendChunk("</div></body></html>");
            }
            break;
    }
    endResponse();
}

void Esp32BaseWeb::sendPageTitle(const char* title, const char* subtitle) {
    sendChunk("<header class='pagehead'><h1>");
    writeHtmlEscaped(title ? title : "");
    sendChunk("</h1>");
    if (subtitle && subtitle[0]) {
        sendChunk("<p>");
        writeHtmlEscaped(subtitle);
        sendChunk("</p>");
    }
    sendChunk("</header>");
}

void Esp32BaseWeb::beginPanel(const char* title) {
    sendChunk("<section class='panel'>");
    if (title && title[0]) {
        sendChunk("<h2>");
        writeHtmlEscaped(title);
        sendChunk("</h2>");
    }
}

void Esp32BaseWeb::endPanel() {
    sendChunk("</section>");
}

void Esp32BaseWeb::sendNotice(UiTone tone, const char* title, const char* message) {
    sendChunk("<div class='notice");
    sendChunk(uiToneClass(tone));
    sendChunk("'><b>");
    writeHtmlEscaped(title ? title : "");
    sendChunk("</b>");
    if (message && message[0]) {
        sendChunk("<br>");
        writeHtmlEscaped(message);
    }
    sendChunk("</div>");
}

void Esp32BaseWeb::sendResultNotice(const ResultNotice* notices, uint8_t count) {
    if (!notices || count == 0) {
        return;
    }
    char value[32];
    for (uint8_t i = 0; i < count; ++i) {
        const ResultNotice& notice = notices[i];
        if (!notice.param || !notice.param[0]) {
            continue;
        }
        if (!hasParam(notice.param)) {
            continue;
        }
        if (notice.value && notice.value[0]) {
            if (!getParam(notice.param, value, sizeof(value)) || strcmp(value, notice.value) != 0) {
                continue;
            }
        }
        sendNotice(notice.tone, notice.title, notice.message);
        return;
    }
}

void Esp32BaseWeb::beginMetricGrid() {
    sendChunk("<div class='metrics'>");
}

void Esp32BaseWeb::sendMetric(const char* label, const char* value, const char* help) {
    sendChunk("<div class='metric'><b>");
    writeHtmlEscaped(value ? value : "");
    sendChunk("</b><span>");
    writeHtmlEscaped(label ? label : "");
    if (help && help[0]) {
        sendChunk(" · ");
        writeHtmlEscaped(help);
    }
    sendChunk("</span></div>");
}

void Esp32BaseWeb::endMetricGrid() {
    sendChunk("</div>");
}

static bool sendInfoRowCompactStart(const char* title, const char* help, const char* value, bool hasAction) {
    sendChunk("<div class='urow'><div><b>");
    sendEscapedHtmlChunk(title ? title : "");
    sendChunk("</b>");
    if (help && help[0]) {
        sendChunk("<small>");
        sendEscapedHtmlChunk(help);
        sendChunk("</small>");
    }
    sendChunk(hasAction ? "</div><div class='uactions'>" : "</div><div class='uactions readonly'>");
    const bool hasValue = value && value[0];
    if (hasValue) {
        sendChunk("<span class='uvalue'>");
        sendEscapedHtmlChunk(value);
        sendChunk("</span>");
    } else if (hasAction) {
        sendChunk("<span class='uvalue empty'></span>");
    }
    return hasValue;
}

static void sendInfoRowCompactEnd() {
    sendChunk("</div></div>");
}

static void sendInfoRowActionGap(bool hasValue) {
    (void)hasValue;
}

static void sendInfoRowActionLink(const char* href, const char* label, Esp32BaseWeb::UiTone tone) {
    sendChunk("<a class='btnlink");
    sendChunk(uiToneClass(tone));
    sendChunk("' href='");
    sendEscapedHtmlChunk(href ? href : "#");
    sendChunk("'>");
    sendEscapedHtmlChunk(label ? label : "");
    sendChunk("</a>");
}

void Esp32BaseWeb::sendInfoRowCompact(const char* title, const char* help, const char* value) {
    sendInfoRowCompactStart(title, help, value, false);
    sendInfoRowCompactEnd();
}

void Esp32BaseWeb::sendInfoRowCompactLink(const char* title, const char* help, const char* value,
                                          const char* href, const char* label, UiTone tone) {
    const bool hasValue = sendInfoRowCompactStart(title, help, value, true);
    sendInfoRowActionGap(hasValue);
    sendInfoRowActionLink(href, label, tone);
    sendInfoRowCompactEnd();
}

void Esp32BaseWeb::sendInfoRowCompactForm(const char* title, const char* help, const char* value,
                                          const char* action, const char* label,
                                          const char* hiddenName, const char* hiddenValue,
                                          UiTone tone) {
    const bool hasValue = sendInfoRowCompactStart(title, help, value, true);
    sendInfoRowActionGap(hasValue);
    sendChunk("<form method='post' action='");
    sendEscapedHtmlChunk(action ? action : "");
    sendChunk("' onsubmit='return once(this)'>");
    if (hiddenName && hiddenName[0]) {
        sendChunk("<input type='hidden' name='");
        sendEscapedHtmlChunk(hiddenName);
        sendChunk("' value='");
        sendEscapedHtmlChunk(hiddenValue ? hiddenValue : "");
        sendChunk("'>");
    }
    sendChunk("<input type='submit'");
    if (tone == UI_DANGER) {
        sendChunk(" class='danger'");
    }
    sendChunk(" value='");
    sendEscapedHtmlChunk(label ? label : "");
    sendChunk("'></form>");
    sendInfoRowCompactEnd();
}

void Esp32BaseWeb::sendPagination(const Pagination& pagination) {
    const uint32_t perPage = pagination.perPage == 0 ? 20 : pagination.perPage;
    const uint32_t totalPages = pagination.total == 0 ? 1 : ((pagination.total + perPage - 1) / perPage);
    uint32_t page = pagination.page == 0 ? 1 : pagination.page;
    if (page > totalPages) {
        page = totalPages;
    }
    char left[64];
    snprintf(left, sizeof(left), "共 %lu 条 / %lu 页",
             static_cast<unsigned long>(pagination.total),
             static_cast<unsigned long>(totalPages));
    sendChunk("<div class='pagination'><span class='muted'>");
    writeHtmlEscaped(left);
    sendChunk("</span><span class='pagerlinks'>");
    sendPaginationLink("首页", pagination, 1, page <= 1);
    sendPaginationLink("上一页", pagination, page > 1 ? page - 1 : 1, page <= 1);
    uint32_t startPage = page > 2 ? page - 2 : 1;
    uint32_t endPage = startPage + 4;
    if (endPage > totalPages) {
        endPage = totalPages;
    }
    if (endPage >= 4 && endPage - startPage < 4) {
        startPage = endPage > 4 ? endPage - 4 : 1;
    }
    for (uint32_t i = startPage; i <= endPage; ++i) {
        sendPaginationPageNumber(pagination, i, page);
    }
    sendPaginationLink("下一页", pagination, page < totalPages ? page + 1 : totalPages, page >= totalPages);
    sendPaginationLink("尾页", pagination, totalPages, page >= totalPages);
    sendChunk("</span><form method='get' class='pagerform'");
    sendPaginationActionPath(pagination.path);
    sendChunk(">");
    const char* pathQuery = pagination.path ? strchr(pagination.path, '?') : nullptr;
    sendQueryHiddenInputs(pathQuery ? pathQuery + 1 : nullptr);
    sendQueryHiddenInputs(pagination.query);
    sendChunk("<label class='muted'>每页</label><select name='per'>");
    const uint16_t options[] = {10, 20, 50};
    for (uint8_t i = 0; i < 3; ++i) {
        char opt[8];
        snprintf(opt, sizeof(opt), "%u", static_cast<unsigned>(options[i]));
        sendChunk("<option value='");
        sendChunk(opt);
        if (perPage == options[i]) {
            sendChunk("' selected>");
        } else {
            sendChunk("'>");
        }
        sendChunk(opt);
        sendChunk("</option>");
    }
    char pageValue[16];
    char totalValue[16];
    snprintf(pageValue, sizeof(pageValue), "%lu", static_cast<unsigned long>(page));
    snprintf(totalValue, sizeof(totalValue), "%lu", static_cast<unsigned long>(totalPages));
    sendChunk("</select><label class='muted'>跳至</label><input type='number' name='page' min='1' max='");
    sendChunk(totalValue);
    sendChunk("' value='");
    sendChunk(pageValue);
    sendChunk("'><button type='submit'>跳转</button></form></div>");
}

