tangyangguang/Esp32Base/src/web/Esp32BaseWeb.inc
bool Esp32BaseWeb::sendResponseHeader(const char* name, const char* value) {
    return ::sendResponseHeader(name, value);
}

bool Esp32BaseWeb::beginResponse(int code, const char* contentType, const char* filename) {
    return ::beginResponse(code, contentType, filename);
}

bool Esp32BaseWeb::beginText(int code) {
    return beginResponse(code, "text/plain; charset=utf-8", nullptr);
}

bool Esp32BaseWeb::beginCsv(int code, const char* filename) {
    return beginResponse(code, "text/csv; charset=utf-8", filename);
}

void Esp32BaseWeb::endResponse() {
    ::endResponse();
}

void Esp32BaseWeb::sendChunk(const char* text) {
    ::sendChunk(text);
}

void Esp32BaseWeb::sendBytes(const uint8_t* data, size_t len) {
    if (!data && len > 0) {
        ESP32BASE_LOG_W("web", "send_bytes invalid data");
        return;
    }
    if (!g_responseActive) {
        ESP32BASE_LOG_W("web", "send_bytes outside response");
        return;
    }
    if (g_responseBroken) {
        return;
    }
    flushChunkBuffer();
    if (!g_responseBroken && len > 0) {
        sendResponseContent(reinterpret_cast<const char*>(data), len);
    }
}

void Esp32BaseWeb::writeHtmlEscaped(const char* text) {
    sendEscapedHtmlChunk(text);
}

void Esp32BaseWeb::writeCsvEscaped(const char* text) {
    sendChunk("\"");
    if (text) {
        for (const char* p = text; *p; ++p) {
            if (*p == '"') {
                sendChunk("\"\"");
            } else {
                char one[2] = {*p, '\0'};
                sendChunk(one);
            }
        }
    }
    sendChunk("\"");
}

void Esp32BaseWeb::sendText(int code, const char* text) {
    g_server.send(code, "text/plain", text ? text : "");
}

void Esp32BaseWeb::sendHtml(int code, const char* html) {
    g_server.send(code, "text/html", html ? html : "");
}

void Esp32BaseWeb::sendJson(int code, const char* json) {
    g_server.send(code, "application/json", json ? json : "{}");
}

void Esp32BaseWeb::redirectSeeOther(const char* url) {
    ::redirectSeeOther(url ? url : "/esp32base");
}

void Esp32BaseWeb::beginJson(int code) {
    if (!beginResponse(code, "application/json", nullptr)) {
        return;
    }
    sendChunk("{");
}

void Esp32BaseWeb::writeJsonEscaped(const char* text) {
    if (!text) {
        return;
    }
    sendEscapedJsonChunk(text);
}

void Esp32BaseWeb::endJson() {
    sendChunk("}");
    endResponse();
}

#if ESP32BASE_ENABLE_APP_CONFIG
bool Esp32BaseAppConfig::setTitle(const char* title) {
    if (!title || !title[0] || strlen(title) >= sizeof(g_appConfigTitle)) {
        return false;
    }
    strlcpy(g_appConfigTitle, title, sizeof(g_appConfigTitle));
    return true;
}

bool Esp32BaseAppConfig::setPageValidateCallback(PageValidateCallback callback) {
    g_appConfigPageValidate = callback;
    return true;
}

bool Esp32BaseAppConfig::setChangeCallback(ChangeCallback callback) {
    g_appConfigChangeCallback = callback;
    return true;
}

bool Esp32BaseAppConfig::setSaveCallback(SaveCallback callback) {
    g_appConfigSaveCallback = callback;
    return true;
}

bool Esp32BaseAppConfig::addGroup(const Group& group) {
    if (!group.id || !group.id[0] || strlen(group.id) > 15 || !group.title || !group.title[0] ||
        strlen(group.title) > LABEL_MAX_LENGTH ||
        g_appConfigGroupCount >= ESP32BASE_APP_CONFIG_MAX_GROUPS || groupExists(group.id)) {
        ESP32BASE_LOG_W("appcfg", "group_register_failed id=%s", group.id ? group.id : "-");
        return false;
    }
    AppConfigGroupSlot& slot = g_appConfigGroups[g_appConfigGroupCount++];
    slot.used = true;
    slot.id = group.id;
    slot.title = group.title;
    return true;
}

bool Esp32BaseAppConfig::addString(const StringField& field) {
    if (g_appConfigFieldCount >= ESP32BASE_APP_CONFIG_MAX_FIELDS ||
        !validFieldCommon(field.groupId, field.ns, field.key, field.label) ||
        !validOptionalHelp(field.help) ||
        field.minLength > field.maxLength || field.maxLength > STRING_MAX_LENGTH ||
        !field.defaultValue || strlen(field.defaultValue) < field.minLength || strlen(field.defaultValue) > field.maxLength) {
        appConfigLogRegisterFailed("string", field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_STRING;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.stringField = field;
    return true;
}

bool Esp32BaseAppConfig::addInt(const IntField& field) {
    if (g_appConfigFieldCount >= ESP32BASE_APP_CONFIG_MAX_FIELDS ||
        !validFieldCommon(field.groupId, field.ns, field.key, field.label) ||
        !validOptionalHelp(field.help) || !validOptionalUnit(field.unit) ||
        field.minValue > field.maxValue || field.defaultValue < field.minValue || field.defaultValue > field.maxValue ||
        field.step <= 0 || !stepMatches(field.defaultValue, field.minValue, field.step)) {
        appConfigLogRegisterFailed("int", field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_INT;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.unit = field.unit;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.intField = field;
    return true;
}

bool Esp32BaseAppConfig::addDecimal(const DecimalField& field) {
    if (g_appConfigFieldCount >= ESP32BASE_APP_CONFIG_MAX_FIELDS ||
        !validFieldCommon(field.groupId, field.ns, field.key, field.label) ||
        !validOptionalHelp(field.help) || !validOptionalUnit(field.unit) ||
        field.scale > DECIMAL_SCALE_MAX || field.minRawValue > field.maxRawValue ||
        field.defaultRawValue < field.minRawValue || field.defaultRawValue > field.maxRawValue ||
        field.stepRaw <= 0 || !stepMatches(field.defaultRawValue, field.minRawValue, field.stepRaw)) {
        appConfigLogRegisterFailed("decimal", field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_DECIMAL;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.unit = field.unit;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.decimalField = field;
    return true;
}

